var language = {};
language.UK = {
	//Інформація про виробника
	VENDOR:{
		"NETIS":{
			"module_name":"Маршрутизатор netis",
			"wireless_rate":"6000Mbps",
			"flash":"256MB",
			"official_website":"netis.ua",
			"login_website":"netis.ua",
			"consumer_hotline":"",
			TITLE: "Маршрутизатор netis"
		}
	},
	//Кнопка
	BUTTON:{
		"btn-start":"Запуск швидких налаштувань",
		"btn-next":"Наступний крок",
		"btn-back":"Попередній крок",
		"btn-return":"Повернути",
		"btn-end":"Завершити",
		"btn-save":"Зберегти",
		"btn-confirm":"Ок",
		"btn-cancel": "Скасувати",
		"btn-edit":"Виправити",
		"btn-add":"Додати",
		"btn-restart":"Перезавантаження маршрутизатора",
		"btn-reponse":"Додаток для зворотнього зв'язку",
		"btn-del-all":"Видалення всіх",
		"btn-reset":"Відновлення до початкового стану",
		"btn-del":"Видалення",
		"btn-refresh":"Оновлення",
		"btn-stop-refresh":"Припинити оновлення",
		"button-version-checking":"Перевірка версії",
		"button-automatic-upgrade":"Автоматичне оновлення",
		"button-retry":"Спробувати ще раз",
		"button-download": "Резервне копіювання",
		"button-qr-code":"Завантажити QR код",
		"button-not-download":"Тимчасово не завантажувати",
		"button-bind-all":"З'єднати всі",
		"button-unbind-all":"Роз’єднати всі",
		"button-backup":"Резервні копії",
		"button-restore":"Відновити",
    	"button-stop":"Зупинити",
    	"button-set":"Налаштування",
		"btn-exit":"Вийти",
    	"btn-nowRestart":"Перезавант",
		"btn-scheduled-restart":"Запл. перезавант",
		"btn-upgradation":"Оновити AP",
		"btn-agree":"погодитись",
		"btn-close":"Закрити",
		"btn-draft":"Проект",
		"btn-send":"Відправити",
		"btn-generate": "ГЕНЕРУВАТИ",
    	"btn-export": "ЕКСПОРТУВАТИ",
		"btn-close":"закрити",
		"btn-wps":"WPS",
    "btn-draft": "Чернетка",
"btn-send": "Надіслати",
"btn-generate": "Згенерувати",
"btn-jump": "Перейти",
"btn-search": "Пошук",
"btn-batch-del": "Масове видалення",
"btn-login": "Увійти",
"btn-view-network": "Перегляд мережі",
"btn-log-out": "Вийти",
"btn-preview": "Попередній перегляд",
"btn-configuration-page": "Сторінка конфігурації"
	},
	//Меню
	MENU:{
		"top-menu":{
			"index":"Головна сторінка",
			"network":"Мережа",
			"application":"Додаток",
			"system":"Інструменти",
      	"ac_controller":"AC Controller",
      		"phone_management":"Bee-Center",
      		"app_management":"Bee-Center",
			"tools":"Інструменти",
			"download":"Сканувати зв’язок",
			"login-out":"Вийти",
			"official-website":"Веб-сайт"
		},
		"sub-menu":{
			wifi_management:{
				name:"Параметри бездротової служби",
				summary:"Параметри бездротової служби"
			},
			networkingEquipment:{
				name:"Мережеві пристрої",
				summary:"пристрій онлайн"
			},
			ap_manage:{
				name:"Всі часові періоди",
				summary:"Всі часові періоди"
			},
			ac_switch:{
				name:"Автоматичний перемикач зв’язку",
				summary:"Автоматичний перемикач зв’язку"
			},
			pilot_lamp:{
				name:"світло індикатора",
				summary:"світло індикатора"
			},
			wired_vlan:{
				name:"Параметри дротової VLAN",
				summary:"Параметри дротової VLAN"
			},
			rf_settings:{
				name:"Параметри RF",
				summary:"Параметри RF"
			},
			restart:{
				name:"перезапустити",
				summary:"перезапустити"
			},
			apac_upgradation:{
				name:"Оновлення/відновлення з фабрики",
				summary:"оновлення"
			},
			ac_changePassword:{
				name:"Параметри пароля входу",
				summary:"Параметри пароля входу"
			},
			wiFiSetUp:{
				name:"Бездротова мережа",
				summary:"Налаштування вашого WiFi"
			},
			lan_setup:{
				name:"Налаштування внутрішньої мережі",
				summary:"Зміна адреси маршрутизатора"
			},
			dhcp_reservation:{
				name:"Резервування адрес Dhcp",
				summary:"Резервування адрес Dhcp"
			},
      		ap_lan_setup:{
				name:"Внутрішні параметри мережі",
				summary:"Змінити адресу маршрутизації"
			},
			external_network:{
				name:"Налаштування доступу в інтернет",
				summary:"Налаштування режиму підключення до мережі і широкосмугового аккаунта"
			},
			wisp:{
				name:"Бездротовий ретранслятор",
				summary:"Перезавантажити бездротовий сигнал суфіксу"
			},
			ipv6:{
				name:"IPv6",
				summary:"ipv6"
			},
			wan_setup:{
				name:"Налаштування доступу в інтернет",
				summary:"Налаштування режиму підключення до мережі і широкосмугового аккаунта"
			},
			multipleSsid:{
				name:"Мережа для гостей",
				summary:"Налаштування спеціальної бездротової мережі для гостей"
			},
			qos:{
				name:"QoS",
				summary:"QoS"
			},
			manage_wifi_QR_code:{
				name:"Сканувати код для з’єднання з WI-FI",
				summary:"Сканувати код для з’єднання з WI-FI"
			},
			tr069:{
				name:"TR069",
				summary:"Протокол управління WAN CPE"
			},
			usb:{
				name:"Функція USB",
				summary:"Функція USB"
			},
			diagnosis:{
				name:"Діагностична функція",
				summary:"Діагностична функція"
			},
			port_mirror:{
				name:"Дублювання порту",
				summary:"Дублювання порту"
			},
			wps:{
				name:"WPS",
				summary:"Налаштування захисту WiFi"
			},
			developer:{
				name:"Додаткові налаштування",
				summary:"Обережне налаштування професійного параметра"
			},
			access_control:{
				name:"Контроль доступу",
				summary:"Налаштування контролю доступу"
			},
			pptp_client:{
				name:"Клієнт PPTP",
				summary:"Клієнт PPTP"
			},
			l2tp_client:{
				name:"Клієнт L2TP",
				summary:"Клієнт L2TP"
			},
			policy_routing:{
				name:"Політика маршрутизації",
				summary:"Політика маршрутизації"
			},
			static_routing:{
				name:"Статичний маршрут",
				summary:"Статичний маршрут"
			},
			iptv:{
				name:"IPTV",
				summary:"IPTV"	
			},
			signal_conditioning:{
				name:"Регулювання сигналу",
				summary:"Налаштування інтенсивності сигналу WiFi"
			},
			portMapping:{
				name:"Порт-маппінг",
				summary:"Налаштування зовнішнього доступу до ресурсів внутрішньої мережі"
			},
			oray_ddns:{
				name:"Динамічне доменне ім'я",
				summary:"Доступ до маршрутизатора через доменне ім'я"
			},
			remoteAccess:{
				name:"Віддалений доступ",
				summary:"Налаштування мережевих служб маршрутизатора"
			},
			wireless_universal_relay:{
				name:"WISP",
				summary:"Розширене покриття"
			},
			wlan_mode:{
				name:"Бездротовий режим",
				summary:"Підтримує режими доступу до інтернету, зокрема бездротовий режим"	
			},
			restart_regularly: {
				name: "Часовий розклад",
				summary: "Часовий розклад"
				}, 
			changePassword:{
				name:"Пароль адміністратора",
				summary:"Зміна пароля адміністратора"
			},
			router_info:{
				name:"Інформація про маршрутизатор",
				summary:"Поточний стан маршрутизатора"
			},
			indicator_light:{
				name:"Індикатор",
				summary:"Перемикач індикаторів"
			},
			factory_settings:{
				name:"Відновлення до початкового стану",
				summary:"Відновлення до початкового стану"
			},
			system_upgrade:{
				name:"Перепрошивка",
				summary:"Оновлення випробування по новіших прошивках"
			},
			parameter_backup:{
				name:"резервне копіювання параметрів",
				summary:"резервне копіювання параметрів/відновити параметри"
			},
			timeSetting:{
				name:"Налаштування часу",
				summary:"Налаштування часу маршрутизатора"
			},
			restart_router:{
				name:"Перезавантаження маршрутизатора",
				summary:"Перезавантаження маршрутизатора"
			},
			mesh_pair:{
				name:"Mesh",
				summary:"Пошук Mesh пари"
			},
			speed_test:{
				name:"Speedtest",
				summary:"Speed Test"
			},
      		captive_portal:{
				name:"Captive Portal",
				summary:"Captive Portal"
			},
			dial_up_log:{
				name:"Журнал набору номера",
				summary:"Аналіз несправностей широкосмугового підключення"
			},
			network_firewall:{
				name:"Мережа firewall",
				summary:"Мережа firewall"
			},
			openvpn_client:{
				name:"OpenVPN Client",
				summary:"Налаштуйте профілі для клієнтів, які будуть використовувати функцію VPN"
			},
			openvpn_server:{
				name:"OpenVPN Server",
				summary:"Налаштуйте VPN та облікові записи для швидкого віддаленого доступу до вашої мережі"
			},
			wireguard_client:{
				name:"Wireguard Client",
				summary:"Резюме: Клієнт WireGuard створює зашифрований тунель для безпечного та швидкого VPN-з'єднання"
			},
			wireguard_server:{
				name:"Wireguard Server",
				summary:"Резюме: Сервер WireGuard керує зашифрованими тунелями і надає безпечні та швидкі VPN-з'єднання"
			},
      		network_4g:{
				name:"Режим 4G",
				summary:"Мобільний Інтернет"	
			},
			network_mode_4g:{
				name:"Режим мережі",
				summary:"Режим мережі"	
			},
			sms:{
				name:"повідомлення",
				summary:"повідомлення"	
			},
			vpn:{
				name:"ВPN проходить за параметрами",
				summary:"ВPN проходить за параметрами"	
			},
		}
	},
	//Мова
	LANG:[
		{value:"CN",txt:"简体中文"},
		{value:"EN",txt:"English"},
		{value:"FR",txt:"Français"},
		{value:"CS",txt:"Čeština"},
		{value:"DE",txt:"Deutsch"},
		{value:"ES",txt:"Español"},
		{value:"IT",txt:"Italiano"},
		{value:"KO",txt:"한국어"},
		{value:"NL",txt:"Nederlands"},
		{value:"PL",txt:"Polski"},
		{value:"PT",txt:"Português"},
		{value:"RU",txt:"Русский язык"},
		{value:"TR",txt:"Türkçe"},
		{value:"UK",txt:"Українська мова"},
//		{value:"AR",txt:"اللغة العربية"},
	],
	//Діалогові вікна
	DIALOG:{
		"wifi-encrypt":{
			title:"Дружні рекомендації",
			content:"Ви не встановили пароль безпровідної мережі, мережева безпека буде під загрозою."
			
		},
		"delete-all":{
			title:"Підтвердження видалення",
			content:"Ви упевнені, що хочете видалити усі дані?"
		},
		"delete-single":{
			title:"Підтвердження видалення",
			content:"Ви упевнені, що хочете видалити цю частину даних?"
		},
		"update":{
			title:"Підтвердження оновлення",
			content:"Оновлення прошивки вимагає декілька хвилин, і після завершення оновлення маршрутизатор автоматично перезавантажиться. Ви упевнені в оновленні?"
		},
		"reset":{
			title:"Підтвердження відновлення",
			content:"Усі параметри конфігурації будуть видалені, і маршрутизатор перезавантажиться, ви упевнені в продовженні?"
		},
		"reset_up":{
			title:"Підтвердження відновлення",
			content:"Маршрутизатор перезавантажиться, щоб відновити налаштування. Потрібно відновити зараз?"
		},
		"restart":{
			title:"Підтвердження перезавантаження",
			content:"Ви упевнені, що хочете негайно перезавантажити маршрутизатор?"
		},
		"open_qos":{
			title:"Підказка",
			content:"Апаратне прискорення буде вимкнено, підтвердьте, щоб продовжити？"
		},
		"speed_up_prompt":{
			title:"Підказка",
			content:"Функція обмеження швидкості пристрою буде недійсною, будь ласка, підтвердьте, чи продовжувати？"
		},
		"tips_vlan":{
			title:"Підказка",
			content:"Ви включили функцію VLAN. Після увімкнення мостикового з'єднання, функція VLAN автоматично відключиться! Ви хочете продовжити?"
		},
		"tips_bridging":{
			title:"Підказка",
			content:"Ви включили функцію мостикового з'єднання. Після увімкнення функції VLAN, функція мостикового з'єднання автоматично відключиться! Ви хочете продовжити?"
		},
		"tips_wiFiSetUp":{
			title:"Підказка",
			content:"Ім’я Wi-Fi буде об’єднано <span id='dual_frequency_name'></span> Якщо бездротовий зв'язок відключено, підключіть його знову "
		},
		"bind_all":{
			title:"Підказка",
			content:"Ви впевнені, що хочете прив’язати всі дані?"
		},
		"unbind_all":{
			title:"Підказка",
			content:"Ви впевнені, що хочете відлучити всі дані?"
		},
    	"network_mode":{
			title:"Підказка",
			content:"Ця операція відключить мережу і впливає на ваші служби даних. Бажаєте продовжити?"
		},
    	"ap_restart":{
			title:"Підтвердити перезавантаження",
			content:"Після налаштування, якщо буде позначено AP, програма негайно перезавантажиться"
		},
		"acap_reset":{
			title:"Підтвердити відновлення",
			content:"Вибір AP відновить параметри фабрики"
		},
		"synchronous_wireless":{
			title:"Синхронний бездротовий",
			content:"Синхронізувати бездротові параметри мережі AC і очистити особисті параметри"
		},
    	"delete-all-ap":{
			title:"підтвердити вилучення",
			content:"Are you sure to delete the offline AP?"
		},
	},
	//Помилковий код
	ERROR:{
	  "0":"Вийшло",
	  "1":"Недійсна команда",
	  "2":"Параметри недійсні",
	  "3":"Не знайдений спосіб",
	  "4":"Не знайдений",
	  "5":"Немає даних",
	  "6":"Доступ заборонений",
	  "7":"Тайм-аут",
	  "8":"Не підтримує",
	  "9":"Невідома помилка",
	  "10":"Підключення не вийшло",
      "-11002":"Ваші неправильні спроби входу до системи досягли три рази, а система затримує перевірку.",
	  "-32700":"Доступ заборонений",
	  "-3260":"Недійсний запит",
	  "-32601":"Не знайдений спосіб",
	  "-32602":"Недійсні параметри",
	  "-32603":"Внутрішня помилка",
	  "-32000":"Не знайдений об'єкт",
	  "-32001":"Не знайдений діалог",
	  "-32002":"Доступ заборонений",
	  "-32003":"ubus Тайм-аут запиту"
	},
	JOURNAL:{
		LOG_CONNECT_STANDARD_DHCP_action: {
			"discover":"Порт WAN відправляє запит на набір номера DHCP DISCOVERY на сервер",
			"request":"Порт WAN відправляє DHCP REQUEST на сервер DHCP",
			"renew_request":"Порт WAN відправляє запит на продовження оренди DHCP REQUEST на сервер DHCP",
			"release":"Порт WAN відправляє відключення DHCP RELEASE на сервер DHCP",
			"ack":"Порт WAN отримує підтвердження конфігурації DHCP ACK, відправлене сервером DHCP",
			"nak":"Порт WAN отримує підтвердження конфігурації DHCP NAK, відправлене сервером DHCP",
			"offer":"Порт WAN отримує відповідь на запит на набір номера DHCP OFFER, відправлений сервером DHCP",
			"bound":"Набір номера вийшов, отримали IP адреса {{ip}}, термін оренди {{time}}",
			"decline":"Порт WAN відправляє підтвердження конфлікту адрес DHCP DECLINE на сервер",
			"renew":"IP-адресу успішно оновлено"
		},
		LOG_CONNECT_STANDARD_PPPOE_action: {
			"padi":"Порт WAN відправляє запит на набір номера PADI на сервер",
			"padr":"Порт WAN відправляє PADR на сервер",
			"pado":"Порт WAN отримує PADO, відправлений сервером",
			"pads":"Порт WAN отримує PADS, відправлений сервером",
			"padt":"Порт WAN відправляє запит на відключення PADT на сервер",
			"":"Порт WAN отримує запит PPPoE на відключення PADT, відправлений сервером",
			"get_ip":"Набір номера вийшов, отримали IP адреса {{ip}}",
			"auth_fail":"Не вийшло пройти аутентифікацію набору номера, перевірте ім'я користувача і пароль або зверніться до оператора.",
			"auth_ok":"Ім'я користувача та пароль вірні, аутентифікація набору номера вийшла.",
			
			"":"Надіслати ім'я користувача та пароль для аутентифікації",
			"":"Користувач запросив відключення або відключення через тайм-аут підключення	",
			"":"Порт WAN відправляє запит на відключення підключення Terminate Request на сервер",
			"":"Порт WAN відправляє підтвердження відключення підключення terminate ACK на сервер",
			"":"Порт WAN отримує запит на відключення terminate Request, відправлений сервером",
			"":"Порт WAN отримує підтвердження відключення підключення terminate ACK, відправлений сервером",
			
			
			"auth_type":"Спосіб аутентифікації, узгоджений між портом WAN і сервером: {{auth_type}}",
			
			"echo_request":"Порт WAN відправляє контроль каналу ECHO REQUEST на сервер",
			"echo_reply":"Порт WAN отримує контроль каналу Echo REPLY, відправлений сервером",
			"":"Порт WAN отримує контроль каналу ECHO REQUEST, відправлений сервером",
			"":"Порт WAN відправляє контроль каналу ECHO REPLY на сервер"
		},
		LOG_CONN_DISC_action: {
			"up":"Порт WAN успішно підключений, поточна швидкість {{speed}}, {{duplex}}",
			"down":"Порт WAN вимкнено"
		}
	},
	//Частина, представлена на сторінці
    PAGES: {
		guide:{
			html:{
				"detect-tip":["Визначення вашого режима доступа в Інтернет", "Налаштування режима доступа в Інтернет"],
				"detect-time":["Час, що залишився до виявлення складає <span class=\"count-down\"> </span>секунд", "це займе близько <span class=\"count-down\"> </span> секунд, зачекайте…"],
				"f-label":["Доступ в Інтернет", "", "Ім'я користувача інтернет-провайдера", "Пароль інтернет-провайдера",
						"IP-адрес", "маска підмережі", "шлюз за замовчуванням", "первинний DNS", "вторинний DNS",
						"Часовий пояс", 
						"Ім'я користувача", "пароль", "тип підключення", "IP-адрес", "маска підмережі", "шлюз за замовчуванням", "первинний DNS", "вторинний DNS",
						"Ім'я користувача", "пароль", "IP-адрес/ім'я домена", "тип підключення", "IP-адрес", "маска підмережі", "шлюз за замовчуванням", "первинний DNS", "вторинний DNS",
						"Ім'я користувача", "пароль", "Шифрування MPPE","IP-адрес/ім'я домена", "тип підключення", "IP-адрес", "маска підмережі", "шлюз за замовчуванням", "первинний DNS", "вторинний DNS",
						"Ім'я Wi-Fi мережі", "пароль Wi-Fi мережі", "пароль управління"],
				"routing-mode":["DHCP", "статична адреса", "DHCP", "статична адреса", "DHCP", "статична адреса"],
				"chk-txt":["Увімкнути IPv6","Встановити пароль WiFi як пароль керування маршрутизатором одночасно","Автоматично отримати нові версії і оновлювати необхідне програмне забезпечення під час простою","Погодитись завантажувати критичні оновлення (потрібно звітувати про MAC адресу та версію програми)","Не погодитись завантажувати критичні оновлення"],
				"upgrade_text":["Ви бажаєте активувати критичні оновлення"],
				"title":["Налаштування імени та паролю Wi-Fi", "Налаштування маршрутизатора завершено і ви можете починати користуватись доступом до Інтернету"],
				"describe":["В цілях безпеки ми рекомендуємо обрати пароль, що складається з букв та цифр", "Будь ласка, повторно підключіться до бездротової мережі"],
				"sub-choose":["Пропустити", "поверутись до налаштувань Інтернету"],
				"tips":["(не обов'язково)", "(не обов'язково)", "(не обов'язково)", "(не обов'язково)", "(не обов'язково)", "(не обов'язково)"],
			},
			js:{
				welcome:"Ласкаво просимо",
				step:["Широсмуговий доступ","Налаштування Wi-Fi","Завершення"],
				wifi_placeholder:["Пароль Wi-Fi та пароль адміністратора","8-63 біта, якщо не зашифровано","8-63 біта пароля Wi-Fi","8-63 біта пароля адміністратора"],
				wisp_placeholder:["Введіть пароль ретрансляції","Пароль не потребується"],
				wan_describe:["Введіть логін і пароль, надані оператором","DHCP використовується в основному для вторинних мереж"],
				detect_result:["Не виявлено доступ до інтернету, просимо виконати з'єднання вручну","Ви вже встановили режим доступу до інтернету для автоматичного отримання IP(DHCP)","Ви встановили режим доступу до інтернету (PPPoE)","Ви встановили режим доступа до інтернету для статичного доступу (static)","Ви встановили режим доступа до інтернету для налаштування IP адреса вручну","Автоматично виявлено режим доступа до інтернету для широкосмугового набора номеру (PPPoE)","Автоматично виявлено режим доступа до інтернету для автоматичного утримання (DHCP)"]
			},
			button:{
				"btn-cancel":"Незашифрований",
				"btn-confirm":"Шифрування"
				
			},
			placeholder:{
				"input-pppoe-username":"Введіть широкосмуговий аккаунт",
				"input-pppoe-password":"Введіть широкосмуговий пароль",
				"input-static-ip":"Введіть IP адресу",
				"input-static-mask":"Введіть маску підмережі",
				"input-static-gateway":"Введіть шлюз за умовчанням",
				"input-static-dns1":"Введіть основний DNS",
				"input-static-dns2":"Введіть альтернативний DNS",
				"input-wifi-ssid":"Введіть ім'я бездротової мережі"
			},
			select:{
				wan_type_sel:[
					{value:"dhcp",txt:"Автоматичне отримання адреси"},
					{value:"pppoe",txt:"Широкосмуговий PPPoE"},
					{value:"static",txt:"Вручну встановити адресу"}
				],
				wan_type_sel_russia:[
					{value:"dhcp",txt:"Отримувати адресу автоматично"},
					{value:"pppoe",txt:"PPPoE широкосмугової мережі"},
					{value:"static",txt:"Налаштувати адресу вручну"},
					{value:"pppoe_r",txt:"Dual AccessPPPoE"},
					{value:"l2tp",txt:"L2TP/Dual AccessL2TP"},
					{value:"pptp",txt:"PPTP/Dual AccessPPTP"},
				],
				mppe_encryption:[
					{value:"0", 	txt:"закрити"},
					{value:"1", 	txt:"відкрити"},
				],
				time_zone_sel:[
					{value:"", txt:"--Виберіть--"}, 
					{value: "-14", txt: "(GMT+14: 00) Острови Ліна"},
					{value: "-13", txt: "(GMT+13: 00) Острови Фенікса"},
					{value: "-12:45", txt: "(GMT+12: 45) Чатемські острови"},
					{value: "-12", txt: "(GMT+12: 00) Веллінгтон"},
					{value: "-11", txt: "(GMT+11: 00) Хоніара"},
					{value: "-10:30", txt: "(GMT+10: 30) Острови Лорда Хау"},
					{value: "-10", txt: "(GMT+10: 00) Канбера"},
					{value: "-9:30", txt: "(GMT+09: 30) Центральна Австралія"},
					{value: "-9", txt: "(GMT+09: 00) Токіо"},
					{value: "-8", txt: "(GMT+08: 00) Пекін"},
					{value: "-7", txt: "(GMT+07: 00) Бангкок"},
					{value: "-6:30", txt: "(GMT+06: 30) М'янма"},
					{value: "-6", txt: "(GMT+06: 00) Дакка"},
					{value: "-5:45", txt: "(GMT+05: 45) Непал"},
					{value: "-5:30", txt: "(GMT+05: 30) Індія"},
					{value: "-5", txt: "(GMT+05: 00) Ісламабад"},
					{value: "-4:30", txt: "(GMT+04: 30) Афганістан"},
					{value: "-4", txt: "(GMT+04: 00) Абу-Дабі"},
					{value: "-3:30", txt: "(GMT+03: 30) Іран"},
					{value: "-3", txt: "(GMT+03: 00) Москва"},
					{value: "-2", txt: "(GMT+02: 00) Афіни"},
					{value: "-1", txt: "(GMT+01: 00) Берлін"},
					{value: "0", txt: "(GMT0) Лондон"},
					{value: "1", txt: "(GMT-01: 00) Ponta Delgada"},
					{value: "2", txt: "(GMT-02: 00) Вашингтон"},
					{value: "3", txt: "(GMT-03: 00) Бразиліа"},
					{value: "3:30", txt: "(GMT-03: 30) Ньюфаундленд"},
					{value: "4", txt: "(GMT-04: 00) Каракас"},
					{value: "5", txt: "(GMT-05: 00) Нью-Йорк"},
					{value: "6", txt: "(GMT-06: 00) Мехіко"},
					{value: "7", txt: "(GMT-07: 00) Солт-Лейк-Сіті"},
					{value: "8", txt: "(GMT-08: 00) Лос-Анджелес"},
					{value: "9", txt: "(GMT-09: 00) Юнона"},
					{value: "9:30", txt: "(GMT-09: 30) Маркізькі острови"},
					{value: "10", txt: "(GMT-10: 00) Гонолулу"},
					{value: "11", txt: "(GMT-11: 00) Острів Мідвей"},
					{value: "12", txt: "(GMT-12: 00) Маджуро"} 
				]
			}
		},
		login:{
			html:{
				"title_h1":"Вітаємо у <span id=\"login_href\"></span>",
				"discribe":"Ви можете використовувати <a  target='view_window' id='login_href'></a> для доступу до Точка доступу",
				"form-tip":["Пароль входу за замовчуванням надрукований на папері мітки пристрою","натисніть кнопку RESET впродовж 6 секунди, маршрутизатор видалить параметри конфігурації, після чого слід переналаштувати маршрутизатор."],
				"f-lbl":["Керуйте обліковими записами","Пароль адміністратора"],
				"modal-title":"Читати вираз",
				"chk-txt":["Я читав і погодився <span  class=\"statement_color\">《Договор про ліцензію програмного забезпечення кінця користувача》 </span>",]
			},
			js:{
				"login":"Увійти",
				"form_tip":"Пароль входу за замовчуванням надрукований на папері мітки пристрою."
			}
		},
		index:{
			html:{
				"f-title":["АП у мережі", "Офлайн пристрої", "З'єднані користувачі","Контролер AC"],
				"sp_describe":["Поточний час:","Час операції пристрою：","Завантаженість процесора：","Завантаженість використання пам'яті：","Інформація про обладнання ","MAC：","Інформація про версію："],
				"single-tip":"Чи контролює його старий AC? Чи повинні ми переключитись на поточний AC",
				"modal-title":"Підказки",
				"equipment_online":["2.4G: <span id='equipment_24_online'></span> Онлайн",
									"5G: <span id='equipment_5_online'></span> Онлайн",
									"дротом: <span id='equipment_wired_online'></span> Онлайн"],
			"title_show":"2.4G:<span class='equipment_24_online'></span>Онлайн,5G:<span class='equipment_5_online'></span>Онлайн,дротова:<span class='equipment_wired_online'></span>Онлайн",
									
			},
			js:{
				"ac_name":["Час онлайн","Список онлайн-хостів"],
				"table-title-ac":["тип","Тривалість онлайн","Метод доступу","RSSI","IP/MAC","Вгору/вниз","AP Name","IP AP"],
				"f-label":["Онлайн","офлайн",],
				"search_hint":"MAC",
			}
		},
    	ap_index:{
			html:{
				"icon-describe":["Інтернет","ворота","Mesh Адміністрація"],
				"txt-box":["Поточна швидкість інтернету","Робочі години"],
				"lbl-reboot":"перезавантажити",
				"internet_IP":'Зовнішня IP-адреса:',
				"lbl-mesh":"Додати новий вузол"
			},
			js:{
				"linkok":"Звичайна мережа",
				"linkoff":"Інтернет-з’єднання було відключено"
			}
		},
    	wifi_management:{
			html:{
				"f-label":["Стан WIFI","SSID","Метод шифрування","Пароль Wifi","Вибір частоти", "бездротова ізоляція", "прихована назва мережі", "обраний період часу","VLAN ID",
							"Інтервал блоку","Пробіл рамки","Праг RTS","2.4G бездротовий режим","Кількість з’єднань клієнтів 2.4G","2.4G вилучає силу сигналу нижче","2.4G забороняє силу сигналу нижче","5G бездротовий режим","Кількість з’єднань клієнтів 5G","5G вилучає силу сигналу нижче","5G забороняє силу сигналу нижче","Мультикаст","Бездротова зона"],
				"tab-item":["Параметри бездротової мережі", "Додаткові параметри бездротової мережі"],
				"tip-sec":"Це глобальний параметр, який налаштує всі мережеві програми",
				"active": ["Sun.","Mon.","Tue.","Wed.","Thu.","Fri.","Sat.",],
				"modal-title":["Параметри бездротової мережі"],
				"text_title":["Максимальна кількість користувачів є (0~32): 0 необмежено", "dBm бездротовий клієнт", "dBm бездротовий доступ",
				"Максимальна кількість користувачів є (0~32): 0 необмежено", "dBm бездротовий клієнт", "dBm бездротовий доступ",],
				"p_prompt":"*(0~100), 0 означає, що функція вимкнена.",
				
				"prompt_text":"(Заповнити 3-4094,0 означає закрито)",
				"chk-txt":["Відкинути", "multicast", "multicast до unicast"],
				"f-label-title":"Увімкнути"
			},
			js:{
				"table_title":["SSID","Пароль", "інформація про стан","VLAN ID","Частота","операція"],
				"copywriting":["Не зашифровано"],
				"f-label":["Увімкнути","Не увімкнути", "змінити", "вилучити"]
			},
			select:{	
				frequency_band:[
					{value:"2G",txt:"2.4G"},
					{value:"5G",txt:"5G"},
					{value:"2G+5G",txt:"2.4G+5G"}
				],
				wifi_encryption:[
					{value:"NONE", 	txt:"Не зашифровано"},
					{value:"AES", 	txt:"WPA/WPA2-PSK  AES"},
					{value:"AES", 	txt:"WPA2/WPA3-PSK  AES"}
				],
				time_interval:[
					{value:"0",txt:"Всі часові періоди"},
					{value:"1",txt:"weekday"},
					{value:"2",txt:"вихідний"},
					{value:"3",txt:"нетиповий"},
				],
				WirelessMode_24:[
					{value:"b", 	txt:"b"},
					{value:"bg", 	txt:"b/g"},
					{value:"bgn", 	txt:"b/g/n"},
					{value:"bgnax", txt:"b/g/n/ax"},
				],
				WirelessMode_5:[
					{value:"a", 	txt:"a"},
					{value:"an", 	txt:"a/n"},
					{value:"aanac", 	txt:"a/n/ac"},
					{value:"aanacax", 	txt:"a/n/ac/ax"}
				],
				hT_GI:[
					{value:"0", 	txt:"Long GI"},
					{value:"1", 	txt:"Short GI"},
				],
				Wireless_area:[
					{value:"1", 	txt:"Китай"},
					{value:"2", 	txt:"США"},
					{value:"3", 	txt:"Європа"},
					{value:"4", 	txt:"Росія"},
					{value:"5", 	txt:"Бангладеш"},
					{value: "6", txt: "Малайзія"}
				]
				
			},
		},
    	ap_manage:{
			html:{
				"f-label":["Стан WIFI","SSID","Метод шифрування","Пароль WIFI","Вибір частоти","Ізолація без дроту","Сховати назву мережі","Виберіть період часу","VLAN ID",
							"Інтервал блоку","Пробіл рамки","Праг RTS","2.4G бездротовий режим","Кількість з’єднань клієнтів 2.4G","2.4G вилучає силу сигналу нижче","2.4G забороняє силу сигналу нижче","5G бездротовий режим","Кількість з’єднань клієнтів 5G","5G вилучає силу сигналу нижче","5G забороняє силу сигналу нижче","Multicast","Бездротова зона",
							"Назва пристрою",
							"Перемикач DHCP","IP-адреса","Маска підмережі","типовий шлях","DNS"],
				"tab-item":["Параметри бездротової мережі","Додаткові параметри бездротової мережі"],
				"tip-sec":"Це особистий параметр, який налаштує лише поточний AP",
				"active": ["Sun.","Mon.","Tue.","Wed.","Thu.","Fri.","Sat.",],
				"modal-title":["Немережеві пристрої","Невідомий AC","Об’єднати мережу","Параметри бездротової мережі","","Змінити назву","DHCP"],
				"text_title":["Максимальна кількість користувачів (0~32): 0 необмежено","Клієнт бездротової мережі dbm","Доступ до бездротового клієнта dbm",
				"Максимальна кількість користувачів (0~32): 0 необмежено","Клієнт бездротової мережі dbm","Доступ до бездротового клієнта dbm",],
				"p_prompt":"*(0~100), 0 означає, що функція вимкнена.",
				"wifi_superior_information":"Назва пристрою：<span id='ap_wifi_name'>0</span>，модель：<span id='ap_wifi_model'>0</span>，IP-адреса：<span id='ap_wifi_ip'>0</span>",
				"single-tip":"Всі програми, які зараз під контролем AC, буде об’єднано<span id='ap_id_href'></span>Керована мережа",
				"prompt_text":"(Заповнити 3-4094, 0 означає закрито)",
				"chk-txt":["Відкинути", "multicast", "multicast до unicast"],
				"f-label-title":"Увімкнути",
				"title_show":["онлайн：<span id='online_quantity'>0</span>платформа,вимкнено：<span id='offline_quantity'>0</span>платформа  <span id='unnetworked_div' class='hidden'> Не в мережі: <i id='unnetworked_quantity' class='f-color3'>0</i></span> <span id='unnetworked_ac_div' class='hidden'> Невідомий AC: <i id='unnetworked_ac' class='f-color3'>0</i></span>",
								"2.4G:<span id='ap_24g'>0</span> платформа，5G:<span id='ap_5g'>0</span> платформа，дротовий:<span id='ap_limited'>0</span> платформа"],
				"delete_offline":"Вилучити відсутній AP",
				"optional_t":"（3-4094,необов’язковий）",
				"merge_networking":"Об’єднати мережу"
			},
			js:{
				"ac_ap_offline_table":["Офлайнові пристрої","Стан","MAC","операція"],
				"ac_ap_online_table":["Назва пристрою<br>(Натисніть, щоб змінити назву)","Стан","Модель","Номер версії","IP/MAC","Час запуску","Кількість терміналів","Операція"],
				"ap_online_table":["тип","Онлайн тривалість","Метод доступу","RSSI","IP/MAC","Вгору/вниз","Назва AP","IP AP"],
				"ac_ap_unnetworked_table":["<input type='checkbox' name='checkboxShall' id='select_All' value='0' class='checkboxShall'>","Модель","Номер версії","IP","MAC","Час запуску"],
				
				"f-label":["Локація","","Персоналізація","Онлайн","Вимкнено","Пошук...","запит успішний","Закр. локацію","Об’єднати мережу"],
				"ac_unnetworked_table":["Модель","Номер версії","IP","MAC","Операція"],
				
				"positioning":"Розташування у процесі...",
				"uplink_speed":"Швидкість передачі",
				"downlink_speed":"Швидкість завантаження",
				"table_title":["SSID","Пароль", "інформація про стан","VLAN ID","Частота","операція"],
				"copywriting":["Не зашифровано","Додати бездротовий","Синхронний бездротовий","(Зараз AC)"],
				"f-wifi-label":["Увімкнути", "вимкнути", "змінити", "вилучити", "приєднатися до мережі"],
        "search_hint":"Назва пристрою/стан/модель/MAC",
			},
			select:{	
				frequency_band:[
					{value:"2G",txt:"2.4G"},
					{value:"5G",txt:"5G"},
					{value:"2G+5G",txt:"5G+2.4G"}
				],
				wifi_encryption:[
					{value:"NONE", 	txt:"Не зашифровано"},
					{value:"AES", 	txt:"WPA/WPA2-PSK  AES"},
					{value:"AES", 	txt:"WPA2/WPA3-PSK  AES"}
				],
				time_interval:[
					{value:"0",txt:"Всі часові періоди"},
					{value:"1",txt:"weekday"},
					{value:"2",txt:"вихідний"},
					{value:"3",txt:"нетиповий"},
				],
				WirelessMode_24:[
					{value:"b", 	txt:"b"},
					{value:"bg", 	txt:"b/g"},
					{value:"bgn", 	txt:"b/g/n"},
					{value:"bgnax", txt:"b/g/n/ax"},
				],
				WirelessMode_5:[
					{value:"a", 	txt:"a"},
					{value:"an", 	txt:"a/n"},
					{value:"aanac", 	txt:"a/n/ac"},
					{value:"aanacax", 	txt:"a/n/ac/ax"}
				],
				hT_GI:[
					{value:"0", 	txt:"Long GI"},
					{value:"1", 	txt:"Short GI"},
				],
				Wireless_area:[
					{value:"1", 	txt:"Китай"},
					{value:"2", 	txt:"США"},
					{value:"3", 	txt:"Європа"},
					{value:"4", 	txt:"Росія"},
					{value:"5", 	txt:"Бангладеш"},
					{value: "6", txt: "Малайзія"}
				]
			},
		},
		ac_switch:{
			html:{
				"f-label":["Перемикач функцій AC", "автоматичний перемикач зв’язку"],
				"modal-title":"Підказки",
				"single-tip":["Функцію AC поточного пристрою буде вимкнено","Функцію AC поточного пристрою буде увімкнено","Вимкнути саморганізацію мережевої функції, і нові додані програми буде вручну прив’язано"],
				"text_title":["(Поточна функція керування AC пристрою)","(Рекомендується вимкнути автоматичний зв’язок і випуск параметрів для нових доданих пристроїв AP після завершення налаштування мережі)"]
			},
		},
		wired_vlan:{
			html:{
				"f-label":["відкрити","VLAN ID","Чи це UNTAG"],
				"text_title":["(Ціле число між 3-4094)"]
			},
			js:{
				"ac_ap_online_table":["<input type='checkbox' name='checkboxShall' id='select_All' value='0' class='checkboxShall'>","Назва пристрою", "модель","IP","MAC","Стан VLAN","VLAN ID","UNTAG"],
				"rf_settings_title":["Всі успішно налаштовані! Будь ласка, зачекайте деякий час і оновіть сторінку для перегляду"]
			},
		},
		pilot_lamp:{
			html:{
				"select_All":["Вибрати всі"],
				"f-label":["Замикач LED"]
			},
			js:{
				
				"ac_ap_online_table":["<input type='checkbox' name='checkboxShall' id='select_All' value='0' class='checkboxShall'>","Назва пристрою", "модель","IP","MAC","Індикатор стану світла"],
				
			},
			select:{	
			
			},
		},
		rf_settings:{
			html:{
				"select_All":["Вибрати всі"],
				"modal-title":"Зміна RF",
				"tip-sec":"Зміна налаштування перезапустить бездротові налаштування, що може призвести до відключення поточного з’єднаного термінала.",
				"f-label":["Канал 2.4G","Канал 5G","Ширина шрифту 2.4G","Ширина шрифту 5G","2.4G сила","5G сила"]
			},
			js:{
				"no_edit":["Не змінювати"],
				"ac_ap_online_table":["<input type='checkbox' name='checkboxShall' id='select_All' value='0' class='checkboxShall'>","Назва пристрою", "модель","IP","MAC","канал","ширина","сила(%)"],
				"rf_settings_title":["Все успішно налаштовано! Будь ласка зачекайте трохи та перезавантажте сторінку для перегляду"]
			},
			select:{	
				bandwidth_2_4:[
					{value:"-1",txt:"Не змінювати"},
					{value:"auto",txt:"автоматичний"},
					{value:"20M",txt:"20M"},
					{value:"40M+",txt:"40M"},
				],
				bandwidth_5:[
					{value:"-1",txt:"Не змінювати"},
					{value:"auto",txt:"автоматичний"},
					{value:"20M",txt:"20M"},
					{value:"40M+",txt:"40M"},
					{value:"80M",txt:"80M"},
					{value:"160M",txt:"160Mhz"},
				],
				channel_2_4:[
					{value:"-1",txt:"Не змінювати"},
					{value:"0", 	txt:"автоматичний"},
					{value:"1", 	txt:"канал 1"},
					{value:"2", 	txt:"канал 2"},
					{value:"3", 	txt:"канал 3"},
					{value:"4", 	txt:"канал 4"},
					{value:"5", 	txt:"канал 5"},
					{value:"6", 	txt:"канал 6"},
					{value:"7", 	txt:"канал 7"},
					{value:"8", 	txt:"канал 8"},
					{value:"9", 	txt:"канал 9"},
					{value:"10", 	txt:"канал 10"},
					{value:"11", 	txt:"канал 11"},
					{value:"12", 	txt:"канал 12"},
					{value:"13", 	txt:"канал 13"}
				],
				channel_5:[
					{value:"-1",txt:"Не змінювати"},
					{value:"0", 	txt:"автоматичний"},
					{value:"36", 	txt:"канал 36"},
					{value:"40", 	txt:"канал 40"},
					{value:"44", 	txt:"канал 44"},
					{value:"48", 	txt:"канал 48"},
					{value:"52", 	txt:"канал 52"},
					{value:"56", 	txt:"канал 56"},
					{value:"60", 	txt:"канал 60"},
					{value:"64", 	txt:"канал 64"},
					{value:"149", 	txt:"канал 149"},
					{value:"153", 	txt:"канал 153"},
					{value:"157", 	txt:"канал 157"},
					{value:"161", 	txt:"канал 161"},
					{value:"165", 	txt:"канал 165"}
				],
				power_2_4:[
					{value:"-1",txt:"Не змінювати"},
					{value:"15",txt:"15"},
					{value:"35",txt:"35"},
					{value:"50",txt:"50"},
					{value:"75",txt:"75"},
					{value:"100",txt:"100"},
				],
				power_5:[
					{value:"-1",txt:"Не змінювати"},
					{value:"15",txt:"15"},
					{value:"35",txt:"35"},
					{value:"50",txt:"50"},
					{value:"75",txt:"75"},
					{value:"100",txt:"100"},
				],
			},
		},
		apac_upgradation:{
			html:{
				"select_All":["Вибрати всі"],
				"modal-title":"Завантажити файл оновлення",
				"view":"Перегляд",
				
			},
			js:{
				"ac_ap_online_table":["<input type='checkbox' name='checkboxShall' id='select_All' value='0' class='checkboxShall'>","Назва пристрою","Модель","IP","MAC","Номер версії"],
				"ac_upgrading_table":["Назва пристрою", "модель","IP","MAC","Перед оновленням версії","Стан оновлення"],
				"upgrade_status":["Поточне оновлення","Оновлення завершено","Не потрібно оновлювати","Вибрані тепер оновлюються","Помилка перевірки файла"],
				"upgradation_title":["Все успішно налаштовано! Будь ласка, зачекайте деякий час і оновіть сторінку для перегляду"]
			},
		},
		ac_changePassword:{
			html:{
				"f-label":["Поточний пароль","Новий пароль","Підтвердити пароль"],
				"tip-sec":"Це глобальний параметр, оновлює всі паролі входу в мережу AP!"
			}
		},
		restart:{
			html:{
				"select_All":["Вибрати всі"],
				"f-label":["Відкрити", "час", "дата"],
				"modal-title":"Перезапланувати",
				"active": ["Sun.","Mon.","Tue.","Wed.","Thu.","Fri.","Sat.",],
			},
			js:{
				
				"ac_ap_online_table":["<input type='checkbox' name='checkboxShall' id='select_All' value='0' class='checkboxShall'>","Назва пристрою", "модель","IP","MAC","Стан перезавант","Перезапустити час"],
			},
		},
		app_management:{
			html:{
				"tl":"Мобільний застосунок<br>Допоможе вам керувати точкою доступу",
				"txt0":["Ним можна керувати локально або віддалено",
						"Сканувати код для активування керування",
						]
			}
			
		},
		lock_screen:{
			html:{
					"bander_txt":["NAP930","Кількість онлайн користувачів","поточний час：","Час операції пристрою：","Загруженість процесора：","Загруженість використання пам’яті：","Інформація про версію：","Пристрій MAC："],
					"text_bt":["Режим AP","FIT AP","Стан керування AC","Встановлено з’єднання з керуванням AC","Адреса AC:","MAC:","оновлення","Версія оновлення","ініціалізація","Ініціалізація AP","Captive Portal Status"],
					"f-label":["Виберіть файл оновлення","Captive Portal Status:","ISP:","NAS ID:","UAM SECERT:","Бездротовий вибір:"],
	"version-status":["Поточна версія", " Остання версія"],
					
					"tipsText":["Підтримується оновлення прошивки, щоб негайно випробувати нову функцію, виправити проблеми і підвищувати стабільність. Рекомендується вам включити цю функцію. Коли ця функція включена, маршрутизатор періодично проситиме нову прошивку на сервері і оновлюватиме прошивку в ранні години"],
					
					"modal-title":["Оновлення", "ініціалізація"],
					"tab-item":["Ручне оновлення", "Онлайное оновлення"],
					"single-tip":"Всі параметри налаштування буде вилучено, а роутер буде перезапущено. Ви впевнені, що бажаєте продовжити?",
					"reset_tip":["Роутер перезапущено, будь ласка, зачекайте та не вимикайте живлення","Роутер оновлено, будь ласка, не вимикайте живлення та зачекайте"],
					"view":["Перегляд"],
					"p_txt":["* Ви можете використовувати AC для керування<br>* Ви можете ручно відключити зв’язок з AC, а потім керувати цим пристроєм",""],
					         
					"f-label-title":["Основний SSID","Visitor SSID"]
			},
			select:{
				isp:[
					{value:"wifisystem", 	txt:"WIFISYSTEM"},
					{value:"hotspotsystem", 	txt:"HOTSPOTSYSTEM"},
				]
			}
		},
		phone_management:{
			html:{
				"tl":"Lei Ke Intelligent Network Management<br>Допоможе вам керувати вашою точкою доступу",
				"txt0":["Віддалене керування, точки доступу також можна керувати віддалено",
						"Візуальне керування, зробить Інтернет-пристрої зрозумілими з першого погляду","Технічна підтримка в форматі спілкування 1 на 1","",
					"Скануйте код для увімкнення керування", "У даний момент немає мережі"]
				}
			
		},
		phone_control_router:{
					html:{
						"desc1":"ВИ МОЖЕТЕ ВІДДАЛЕНО КЕРУВАТИ СВОЄЮ ТОЧКОЮ ДОСТУПУ ЗА ДОПОМОГОЮ ДОДАТКУ Bee-Center",
						"desc2":"",
						"icon":"Клацніть тут, щоб негайно зв'язати додаток!",
						"opt_desc":"Знайомство з вашим Bee-Center",
						"title":"Cканувати та зв'язати",
						"step_title_desc":["Завантажте додаток Bee-Center", "Прив'яжіть додаток Bee-Center"],
						"qr-desc":["ЗАВАНТАЖИТИ","ЗАВАНТАЖИТИ","Сканувати QR-код"],
						"android":"Android",
						"iOS":"iOS"
					}
				},
		networkingEquipment:{
			html:{
				"modal-title": ["Підказка","Змінити назву пристрою"],
				"f-label": ["назва пристрою"], 
				"tab-item":["Список хостів-компьютерів для доступу в інтернет", "Чорний список обладнання"],
				"online-title":["Мій домашній комп'ютер і мобільний(<span class=\"online-device-count\"></span>устаткування онлайн)","Чорний список доступу в інтернет (<span class=\"black-device-count\"></span>кількість)"]
			},
			js:{
				limit_speed:"Обмеження швидкості",
				limited_speed:"Швидкість обмежена",
				online_time:"Онлайнова тривалість",
				uplink_speed:"Швидкість передачі даних",
				downlink_speed:"Швидкість завантаження даних",
				pull_black:"Додавання в чорний список",
				relieve_black:"Звільнення з чорного списку",
				not_limit:"(Значення 0 означає необмежену швидкість)",
				btn_confirm:"Визначення",
				btn_cancel_limit:"Скасування обмеження швидкості",
				pulling_black:"Додається в чорний список……",
				relieving_black:"Звільняється з чорного списку……",
				relieve_time:"Тривалість в чорному списку"
			}
		},
		wiFiSetUp:{
			html:{
				"tab-item":["Налаштування 2.4GHz WiFi","Налаштування 5GHz WiFi"],
				"f-label":["Подвійна частота в одному","Стан 2.4GHz WiFi","Ім'я WiFi (SSID)","Зашифрований вид","Пароль WiFi","Мережевий режим","Широкосмуговий канал","Бездротовий канал","TWT",
						"Стан 5GHz WiFi","Ім'я WiFi (SSID)","Зашифрований вид","Пароль WiFi","Мережевий режим","Широкосмуговий канал","Бездротовий канал","TWT","Резервна мережа WI-FI5",
						"Статус WIFI", "Ім'я WiFi (SSID)", "Метод шифрування", "Пароль WiFi","2.4G","Мережевий режим","Широкосмуговий канал","Бездротовий канал","TWT", "5G", "Мережевий режим","Широкосмуговий канал","Бездротовий канал","TWT","Резервна мережа WI-FI5",], 
				"chk-txt":["Ім'я прихованої мережі","Ім'я прихованої мережі","Підтримуйте поточну мережу 5G "],
				"prompt_text":["Додаткові налаштування>>","Додаткові налаштування>>","Додаткові налаштування>>"],
				"tipsText":"(комп'ютер і мобільний не може знайти приховану бездротову мережу, необхідно додати бездротову мережу вручну)",
				"text_title":["Сумісна частина не підтримує мережеву карту 820.11AX ",
							"Сумісна частина не підтримує мережеву карту 820.11AX ",
							"Деякі пристрої Wi-Fi 5 (наприклад, деякі ноутбуки, що використовують мережеві карти Intel) можуть підключатися до цього сигналу Wi-Fi, коли модель Wi-Fi 6 неможливо сканувати через довгий диск мережевої карти ",
							"Сумісна частина не підтримує мережеву карту 820.11AX ",
							"Деякі пристрої Wi-Fi 5 (наприклад, деякі ноутбуки, що використовують мережеві карти Intel) можуть підключатися до цього сигналу Wi-Fi, коли модель Wi-Fi 6 неможливо сканувати через довгий диск мережевої карти ",],
				"tip-sec":"Вимкнено часовий Wi-Fi",
			},
			select:{
				wls_2_4_ap_mode_sel:[
					{value:"NONE", 	txt:"Незашифрований"},
					{value:"AES", 	txt:"WPA/WPA2-PSK  AES"},
					{value:"AES", 	txt:"WPA2/WPA3-PSK  AES"}
//					{value:"psk+aes", 	txt:"WPA-PSK AES"},
//					{value:"psk2+aes", 	txt:"WPA2-PSK AES"},
//					{value:"mixed-psk+aes", txt:"WPA/WPA2-PSK AES"}
				],
				wlb_2_4_channel_width_sel:[
					{value:"20M", 	txt:"20M"},
					{value:"40M+", 	txt:"40M"}
				],
				wireless_base_2_4_channel_sel:[
					{value:"0", 	txt:"Автоматичний"},
					{value:"1", 	txt:"Канал 1"},
					{value:"2", 	txt:"Канал 2"},
					{value:"3", 	txt:"Канал 3"},
					{value:"4", 	txt:"Канал 4"},
					{value:"5", 	txt:"Канал 5"},
					{value:"6", 	txt:"Канал 6"},
					{value:"7", 	txt:"Канал 7"},
					{value:"8", 	txt:"Канал 8"},
					{value:"9", 	txt:"Канал 9"},
					{value:"10", 	txt:"Канал 10"},
					{value:"11", 	txt:"Канал 11"},
					{value:"12", 	txt:"Канал 12"},
					{value:"13", 	txt:"Канал 13"}
				],
				wireless_base_2g_sel:[
					{value:"b", 	txt:"802.11b"},
//					{value:"g", 	txt:"802.11g"},
//					{value:"n", 	txt:"802.11n"},
					{value:"bg", 	txt:"802.11b/g"},
//					{value:"gn", 	txt:"802.11g/n"},
					{value:"bgn", 	txt:"802.11b/g/n"},
					{value:"bgnax", 	txt:"802.11b/g/n/ax"},
				],
				wireless_base_5g_sel:[
					{value:"a", 	txt:"802.11a"},
//					{value:"n", 	txt:"802.11n"},
					{value:"an", 	txt:"802.11a/n"},
//					{value:"anac", 	txt:"802.11n/ac"},
					{value:"aanac", 	txt:"802.11a/n/ac"},
					{value:"aanacax", 	txt:"802.11a/n/ac/ax"}
					
				],
				wls_5_ap_mode_sel:[
					{value:"NONE", 	txt:"Незашифрований"},
					{value:"AES", 	txt:"WPA/WPA2-PSK  AES"},
					{value:"AES", 	txt:"WPA2/WPA3-PSK  AES"}
//					{value:"psk+aes", 	txt:"WPA-PSK AES"},
//					{value:"psk2+aes", 	txt:"WPA2-PSK AES"},
//					{value:"mixed-psk+aes", 	txt:"WPA/WPA2-PSK AES"}
				],
				wlb_5_channel_width_sel:[
					{value:"20M", 	txt:"20M"},
					{value:"40M+", 	txt:"40M"},
					{value:"80M", 	txt:"80M"},
//					{value:"160M", txt:"160M"},
//					{value:"80M+80M", txt:"80M+80M"},
				],
				wireless_base_5_channel_sel:[
					{value:"0", 	txt:"Автоматичний"},
					{value:"36", 	txt:"Канал 36"},
					{value:"40", 	txt:"Канал 40"},
					{value:"44", 	txt:"Канал 44"},
					{value:"48", 	txt:"Канал 48"},
					{value:"52", 	txt:"Канал 52"},
					{value:"56", 	txt:"Канал 66"},
					{value:"60", 	txt:"Канал 60"},
					{value:"64", 	txt:"Канал 64"},
					{value:"149", 	txt:"Канал 149"},
					{value:"153", 	txt:"Канал 153"},
					{value:"157", 	txt:"Канал 157"},
					{value:"161", 	txt:"Канал 161"},
					{value:"165", 	txt:"Канал 165"}
				],
				twt_select_24:[
					{value:"0", 	txt:"закрити"},
					{value:"1", 	txt:"відкрити"},
				],
				twt_select_5:[
					{value:"0", 	txt:"закрити"},
					{value:"1", 	txt:"відкрити"},
				],
				backup_network_select_5:[
					{value:"0", 	txt:"закрити"},
					{value:"1", 	txt:"відкрити"},
				],
				dual_frequency_encryption_select:[
					{value:"NONE", 	txt:"Незашифрований"},
					{value:"AES", 	txt:"WPA/WPA2-PSK  AES"},
					{value:"AES", 	txt:"WPA2/WPA3-PSK  AES"}
				],
				twt_select_dual_frequency:[
					{value:"0", 	txt:"закрити"},
					{value:"1", 	txt:"відкрити"},
				],
				select_dual_frequency:[
					{value:"0", 	txt:"закрити"},
					{value:"1", 	txt:"відкрити"},
				],
				wlb_2_4_channel_width_sel_all:[
					{value:"20M", 	txt:"20M"},
					{value:"40M+", 	txt:"40M"}
				],
				wireless_base_2_4_channel_sel_all:[
					{value:"0", 	txt:"Автоматичний"},
					{value:"1", 	txt:"Канал 1"},
					{value:"2", 	txt:"Канал 2"},
					{value:"3", 	txt:"Канал 3"},
					{value:"4", 	txt:"Канал 4"},
					{value:"5", 	txt:"Канал 5"},
					{value:"6", 	txt:"Канал 6"},
					{value:"7", 	txt:"Канал 7"},
					{value:"8", 	txt:"Канал 8"},
					{value:"9", 	txt:"Канал 9"},
					{value:"10", 	txt:"Канал 10"},
					{value:"11", 	txt:"Канал 11"},
					{value:"12", 	txt:"Канал 12"},
					{value:"13", 	txt:"Канал 13"}
				],
				wireless_base_2g_sel_all:[
					{value:"b", 	txt:"802.11b"},
//					{value:"g", 	txt:"802.11g"},
//					{value:"n", 	txt:"802.11n"},
					{value:"bg", 	txt:"802.11b/g"},
//					{value:"gn", 	txt:"802.11g/n"},
					{value:"bgn", 	txt:"802.11b/g/n"},
					{value:"bgnax", 	txt:"802.11b/g/n/ax"},
				],
				wireless_base_5g_sel_all:[
					{value:"a", 	txt:"802.11a"},
//					{value:"n", 	txt:"802.11n"},
					{value:"an", 	txt:"802.11a/n"},
//					{value:"anac", 	txt:"802.11n/ac"},
					{value:"aanac", 	txt:"802.11a/n/ac"},
					{value:"aanacax", 	txt:"802.11a/n/ac/ax"}
					
				],
				wlb_5_channel_width_sel_all:[
					{value:"20M", 	txt:"20M"},
					{value:"40M+", 	txt:"40M"},
					{value:"80M", 	txt:"80M"},
//					{value:"160M", txt:"160M"},
//					{value:"80M+80M", txt:"80M+80M"},
				],
				wireless_base_5_channel_sel_all:[
					{value:"0", 	txt:"Автоматичний"},
					{value:"36", 	txt:"Канал 36"},
					{value:"40", 	txt:"Канал 40"},
					{value:"44", 	txt:"Канал 44"},
					{value:"48", 	txt:"Канал 48"},
					{value:"52", 	txt:"Канал 52"},
					{value:"56", 	txt:"Канал 66"},
					{value:"60", 	txt:"Канал 60"},
					{value:"64", 	txt:"Канал 64"},
					{value:"149", 	txt:"Канал 149"},
					{value:"153", 	txt:"Канал 153"},
					{value:"157", 	txt:"Канал 157"},
					{value:"161", 	txt:"Канал 161"},
					{value:"165", 	txt:"Канал 165"}
				],
				twt_select_24_all:[
					{value:"0", 	txt:"закрити"},
					{value:"1", 	txt:"відкрити"},
				],
				twt_select_5_all:[
					{value:"0", 	txt:"закрити"},
					{value:"1", 	txt:"відкрити"},
				],
			}
		},
		multipleSsid:{
			html:{
				"tab-item":["Налаштування мережі для гостей 2.4GHz","Налаштування мережі для гостей 5GHz"],
				"f-label":["Стан мережі для гостей","Ім'я мережі для гостей 2.4GHz (SSID)","Ім'я мережі для гостей 5GHz (SSID)","Зашифрований вид","Пароль мережі для гостей","Широкосмуговий канал","Бездротовий канал","5GHz Стан мережі для гостей","Ім'я мережі для гостей (SSID)","Зашифрований вид","Пароль мережі для гостей","Широкосмуговий канал","Бездротовий канал"],
				"tipsText":"(комп'ютер і мобільний не може знайти приховану безпровідну мережу, необхідно додати безпровідну мережу вручну)",
				"chk-txt":"Ім'я прихованої мережі"
			},
			select:{
				wls_2_4_ap_mode_sel:[
					{value:"NONE", 	txt:"Незашифрований"},
					{value:"AES", 	txt:"WPA/WPA2-PSK  AES"},
					{value:"AES", 	txt:"WPA2/WPA3-PSK  AES"}
					
//					{value:"psk+aes", 	txt:"WPA-PSK AES"},
//					{value:"psk2+aes", 	txt:"WPA2-PSK AES"},
//					{value:"mixed-psk+aes", txt:"WPA/WPA2-PSK AES"}
				],
				wlb_2_4_channel_width_sel:[
					{value:"HT20", 	txt:"20M (сильна завадостійка)"},
					{value:"HT40", 	txt:"40M (швидка швидкість)"}
				],
				wireless_base_2_4_channel_sel:[
					{value:"0", 	txt:"Автоматичний"},
					{value:"1", 	txt:"Канал 1"},
					{value:"2", 	txt:"Канал 2"},
					{value:"3", 	txt:"Канал 3"},
					{value:"4", 	txt:"Канал 4"},
					{value:"5", 	txt:"Канал 5"},
					{value:"6", 	txt:"Канал 6"},
					{value:"7", 	txt:"Канал 7"},
					{value:"8", 	txt:"Канал 8"},
					{value:"9", 	txt:"Канал 9"},
					{value:"10", 	txt:"Канал 10"},
					{value:"11", 	txt:"Канал 11"},
					{value:"12", 	txt:"Канал 12"},
					{value:"13", 	txt:"Канал 13"}
				],
				wls_5_ap_mode_sel:[
					{value:"NONE", 	txt:"Незашифрований"},
					{value:"AES", 	txt:"AES"},
					{value:"AES", 	txt:"WPA2/WPA3-PSK  AES"}
//					{value:"psk+aes", 	txt:"WPA-PSK AES"},
//					{value:"psk2+aes", 	txt:"WPA2-PSK AES"},
//					{value:"mixed-psk+aes", 	txt:"WPA/WPA2-PSK AES"}
				],
//				wlb_5_channel_width_sel:[
//					{value:"HT20", 	txt:"20M"},
//					{value:"HT40", 	txt:"40M"},
//					{value:"HT80", 	txt:"80M"},
//					{value:"HT160", txt:"160M"},
//					{value:"HT80_80", txt:"80M+80M"},
//				],
				wireless_base_5_channel_sel:[
					{value:"0", 	txt:"Автоматичний"},
					{value:"36", 	txt:"Канал 36"},
					{value:"40", 	txt:"Канал 40"},
					{value:"44", 	txt:"Канал 44"},
					{value:"48", 	txt:"Канал 48"},
					{value:"52", 	txt:"Канал 52"},
					{value:"56", 	txt:"Канал 66"},
					{value:"60", 	txt:"Канал 60"},
					{value:"64", 	txt:"Канал 64"},
					{value:"149", 	txt:"Канал 149"},
					{value:"153", 	txt:"Канал 153"},
					{value:"157", 	txt:"Канал 157"},
					{value:"161", 	txt:"Канал 161"},
					{value:"165", 	txt:"Канал 165"}
				]				
			}
		},
		qos:{
			html:{
				"f-label":["Перемикач QoS", "Лінія зв'язку передачі", "Лінія зв'язку завантаження"], 
        "tip-sec":["Після вмикання параметрів QoS вона ефективно зменшує проблему споживання ширини посилання окремих пристроїв, забезпечуючи, що кожен пристрій використовує ширину посилання мережі розумно і ефективно."]
			},
		},
		manage_wifi_QR_code:{
			html:{
				"f-label":[""],
			
				"qr_h2":["Бездротова мережа покриття", "Бездротова мережа покриття"],
				"qr_p3":["Цю службу надає Leike Router","Цю службу надає Leike Router"],
				"qrcode_right_h2":["Будь ласка, виберіть SSID для WeChat Wi-Fi з'єднання", "Встановіть вітальне повідомлення" ,"Завантажити код QR зараз, друкувати і надіслати його у магазині", "Звантажити код QR зараз<br>Друкувати і надіслати його у магазині"],
				"qr_form_tx":["Пропонуйте кількість слів не більше 16. Приклад:<br>· Відкрити WeChat для сканування і з’єднання з вільним Wi-Fi<br>· Ласкаво просимо до Old Wharf"]
			},
		},
		tr069:{
			html:{
				"f-label":["CWMP", "Модель даних TR069", "URL ACS", "Ім'я користувача ACS", "Пароль ACS", "Доступ до URL-адреси ONU", "Ім'я користувача доступу", "Пароль доступу", "Порт", "Інформувати", "Період інформування", "TR111", "URL", "Порт", "Ім'я користувача", "Пароль"],
				"advance_toggle":"Розширені налаштування>>",
				"prompt_text":["секунди","(необов'язково)","(необов'язково)"]
			},
			select:{
				data_mode:[
					{value:"0",txt:"TR098"},
					{value:"1",txt:"TR181"}
				]
			}
		},
		usb:{
			html:{
				"tab-item":["USB", "USB Dongle"],
				"f-label":["Стан USB ",
							"SMB Share "," Username "," Password "," Permissions "," Share Path",
							"DLNA Sharing", "Sharing Path",
							"FTP sharing ", "username", "password", "sharing path",
							"USB Internet Access","",
							"Ім’я користувача, пароль", "права доступу", "спільний шлях",],
				"tipsText":["Після вмикання спільного використання можна отримати доступ до файлів, які керують пристроями зберігання за допомогою протоколу SMB",
			"DLNA Мультимедійне спільне використання: Після ввімкнення протоколу спільного використання мультимедійних даних ви можете завжди відтворити відповідні ресурси, зокрема зображення, музику, відео тощо, з пристрою зберігання",
			"Спільне використання FTP: Після ввімкнення протоколу спільного використання FTP ви можете керувати ресурсами пристроїв зберігання, такими як зображення, музика, відео тощо",
			"Доступ до інтернету USBdongle: ви можете додавати мережеву карту USB і ділитися маршрутом для з’єднання з інтернетом"],
				"checkbox_lb":"Пріоритет даний для приступу до дротового інтернету",
				"modal-title":["змінити","Виберіть шлях"],
			},
			select:{
				smb_power:[
					{value:"no",txt:"Читання і запис"},
					{value:"yes",txt:"лише читання"},
		
				]
			},
			js:{
				"button_add":["Виявлення", "Вилучення"],
				"detection_result":["Будь ласка, вставте пристрій зберігання USB", "запущений пристрій зберігання USB", "Перевірка...", "Вилучення...", "Вилучення успішного встановлення", "Вилучення зазнало невдачі"],
				"root_path":"кореневий каталог",
				"please_select":"Будь ласка, виберіть",
				"path_not_find":"Список підкаталогів ще не знайдено",
				"no_subdirectory_find":"Зараз у цьому каталозі немає підкаталогів",
			}
		},
		diagnosis:{
			html:{
				title:"діагностика",
				"f-label":["Діагностичний інструмент", "IP адреса/назва домену", "кількість пінгів", "розмір пінгових пакетів", "максимальний TTL шляху стеження"]
			},
			select:{
				diagnostic_options:[
					{value:"ping", 	txt:"Ping"},
					{value:"tracert", 	txt:"Tracert"}	
				]
			},
			js:{
				"button-diagnosis":"Почати",
			}
		},
		port_mirror:{
			html:{
				"f-label":["Порт джерела", "Порт призначення"]
			},
			select:{
				source_options:[],
				dst_options:[]
			},
			js:{
				"table-title":["Порт джерела", "Порт призначення","операція"],
				"label":["Всі"]
			}
			
		},
		lan_setup:{
			html:{
				"tab-item":["IPv4","IPv6"],
				"f-label":["Адреса внутрішньої мережі","Маска підмережі","Автоматично призначена адреса (служба DHCP)","Початок пулу адрес", "Кінець пулу адрес","Метод розподілу IP адрес"],
				"reset_tip":"Маршрутизатор перезавантажується, не вимикайте живлення, почекайте трохи……",
//				Початкова адреса пулу адрес,Початкова адреса пулу адрес
//				"f-explain":["(Ви також можете відвідати маршрутизатор через netis.cc у внутрішній мережі)"]
			},
			select:{
				ip_address_ipv6:[
					{value:"stateless", 	txt:"без стану"},
					{value:"stateful", 	txt:"із станом"},
					
				]
			}
		},
    	ap_lan_setup:{
			html:{
				"tab-item":["IPv4","IPv6"],
				"f-label":["Внутрішня мережева адреса","Маска підмережі","Автоматичне призначення адрес (служба DHCP)","Запускається база адрес","Кінець бази адрес ",
							"Динамічне отримання","Поточне отримання IP-адреси","Маска підмережі","Поточний шлях","DNS","IP-адреса","Маска підмережі","Поточний шлях","DNS","Метод призначення IP-адреси",],
//				地址池起始地址,地址池结束地址
//				"f-explain":["(您在内网也可以通过<span id=\"login_site\" class=\"tipsText\"></span>访问路由器)"]
				"reset_tip":"Роутер перезапущено, будь ласка, не вимикайте живлення"
			},
			select:{
				ip_address_ipv6:[
					{value:"stateless", txt:"Без стану"},
					{value:"stateful", 	txt:"Стан присутній"},
					
				]
			}
		},
		dhcp_reservation:{
			html:{
				"f-label":["Назва вузла", "адреса MAC", "IP-адреса"],
			},
			js:{
				"table-title":['Серійний номер', 'Назва вузла', 'Адреса MAC', 'Адреса IP', 'Операція'],
				"txt":["Змінити", "вилучити", "успішно вилучити", "успішно змінити"],
			},
		},
		wan_setup:{
			html:{
				"f-label":["перемикати","IP версія","Метод доступу до інтернету","Назва з’єднання","Прив’язка порту","Увімкнути сервер DHCP","Вмикач NAT","Список служб","Тип VLAN","VLAN ID","802.1p",
						"MTU","Рахунок PPPoE","Пароль PPPoE","Authentication Type","Idle Timeout",
						"IP-адреса","Маска підмережі","Типовий шлях","DNS1","DNS2","IPv6CP Extension Mode","Метод доступу до інтернету IPV6","IP-адреса","Типовий шлях","Метод DNS","DNS1","DNS2","Префікс IPv6 LAN","IPv6",
							"Використовувати статичну IP адресу","IP адресу","Subnet Mask","Start Address","End Address","Port Binding"],

				"checkbox_lb":["LAN1","LAN2","LAN3","LAN4","2.4G_Main","5G_Main",'2.4G_Guest',"5G_Guest","LAN1","LAN2","LAN3","LAN4","2.4G_Main",'2.4G_Guest',"5G_Main","5G_Guest"],
			},
			js:{
				"label":["bridge","Create a WAN connection",]
				
			},
		
			select:{
				proto:[
					{value:"IPv4", 	txt:"IPv4"},
					
					{value:"IPv4/v6", txt:"IPv4/v6"}
				],
				
				IPv6mode_select:[
					{value:"pppoe", 	txt:"PPPoE"},
					{value:"dhcp", 	txt:"DHCP"},
					{value:"static", 	txt:"Static"},	
					{value:"bridge", 	txt:"Bridge"},
				],
				service_type:[
					{value:"-1", 	txt:"Create WAN Connection"},
				
				],
				servList:[
					{value:"internet", 	txt:"INTERNET"},
					{value:"tr069", 	txt:"TR069"},
          {value:"iptv", 	txt:"IPTV"},
					{value:"voip", 	txt:"VOIP"},
				],
				Priority:[
					{value:"0", 	txt:"0"},
					{value:"1", 	txt:"1"},
					{value:"2", 	txt:"2"},
					{value:"3", 	txt:"3"},
					{value:"4", 	txt:"4"},
					{value:"5", 	txt:"5"},
					{value:"6", 	txt:"6"},
					{value:"7", 	txt:"7"},
				],
				WBDMode:[
					{value:"-1", 	txt:"UnTag"},
				
					{value:"2", 	txt:"Tag"},
				],
				PrefixSrc:[
					{value:"0", 	txt:"Автоматичний"},
					{value:"1", 	txt:"Ручний"},
					
				],
				DNSv6Src:[
					{value:"auto", 	txt:"Автоматичний"},
					{value:"manu", 	txt:"Ручний"},
				],
		
				internet_access_ipv6:[
					{value:"auto", 	txt:"Автоматичний"},
					{value:"manu", 	txt:"Ручний"},
					
				],
				connTrigger:[
					{value:"AlwaysOn", 	txt:"Always On"},
					{value:"OnDemand", 	txt:"On Demand"},
				],
				AuthType:[
					{value:"PAP,CHAP,MS-CHAP", 	txt:"Auto"},
					{value:"PAP", 	txt:"PAP"},
					{value:"CHAP", 	txt:"CHAP"}
				],
				
			}
		},
		external_network:{
			html:{
				"tab-item":["Режим маршруту","Режим мосту"],
					"ipv4_infoone_lable":["PPPoE широкосмугової мережі","Автоматичне отримання адреси","Ручне налаштування адреси"],
					
					"f-label":["Спосіб виходу до мережі",
							"Обліковий запис PPPoE","Пароль PPPoE","MAC-адреса", "MTU","DNS, якій надають перевагу","Резервна DNS","Робочий режим","Конфігурація порту WAN", "Назва сервера", "Назва AC",
							"MAC-адреса","MTU","DNS, якій надають перевагу","Резервна DNS","Робочий режим","Конфігурація порту WAN",
							"IP-адреса","Маска підмережі","Шлюз за замовчуванням","MAC-адреса","DNS, якій надають перевагу","Резервна DNS","MTU","Робочий режим","Конфігурація порту WAN",
							"Ім'я користувача","Пароль","MAC-адреса","MTU","Тип з'єднання","IP-адреса","Маска підмережі","Шлюз за замовчуванням","DNS, якій надають перевагу","Резервна DNS","Робочий режим","Ім'я сервера","Назва AC",
							"Ім'я користувача","Пароль","MAC-адреса","MTU","IP-адреса/Ім'я домена","Тип з'єднання","IP-адреса","Маска підмережі","Шлюз за замовчуванням","DNS, якій надають перевагу","Альтернативна DNS","Робочий режим",
							"Ім'я користувача","Пароль","MAC-адреса","MTU","Шифрування MPPE","IP-адреса/Ім'я домена","Тип з'єднання","IP-адреса","Маска підмережі","Шлюз за замовчуванням","DNS, якій надають перевагу","Альтернативна DNS","Робочий режим",
							"","Перемикач IPv6","Метод доступу до інтернету",	
							"IP-адреса","Шлюз за замовчуванням","Префікс LAN IPv6","","Режим DNS","DNS, якій надають перевагу","Альтернативна DNS",
							"DSLITE","AFTR"],
					
					"prompt_text":["Розширені налаштування>>","(опціонально)","(опціонально)","(лише для користувачів у особливих регіонах)","(лише для користувачів у особливих регіонах)",
								"Розширені налаштування>>","(опціонально)","(опціонально)",
								"(опціонально)","Розширені налаштування>>",
								"(опціонально)","(опціонально)","Розширені налаштування>>","(лише для користувачів у особливих регіонах)","(лише для користувачів у особливих регіонах)",
								"(опціонально)","(опціонально)","Розширені налаштування>>",
								"(опціонально)","(опціонально)","Розширені налаштування>>",],
					"prompt_text_ipv6":["(Опціонально)","(Опціонально)","(Опціонально)","(Опціонально)","(Опціонально)"],
					
					"routing-mode":["Режим доступу до Інтернету зі спільним IP", "Режим точки доступу",
								"Режим доступу до Інтернету зі спільним IP", "Режим точки доступу",
								"Режим доступу до Інтернету зі спільним IP", "Режим точки доступу",
								"Автоматичний доступ (DHCP)", "Статична адреса", "Режим мережі зі спільним IP", "Режим точки доступу",
								"Автоматичний доступ (DHCP)", "Статична адреса", "Режим мережі зі спільним IP", "Режим точки доступу",
								"Автоматичний доступ (DHCP)", "Статична адреса", "Режим мережі зі спільним IP", "Режим точки доступу",],
					
					"a-mac":["Клон MAC-адреси","MAC роутера","Клон MAC-адреси","MAC роутера","Клон MAC-адреси","MAC роутера","Клон MAC-адреси","MAC роутера","Клон MAC-адреси","MAC роутера","Клон MAC-адреси","MAC роутера"],
					
					"routing-mode-ipv6":["Автоматично","Ручне з'єднання","Автоматично","Ручне з'єднання","відкрити","закрити","Автоматично","Ручне з'єднання"]
					},
			select:{
				wan1_select0:[
					{value:"auto", 	txt:"Автоматичний режим"},
					{value:"10f", 	txt:"10M Повний дуплексний"},
					{value:"10h", 	txt:"10M Напівдуплекс"},
					{value:"100f", 	txt:"100M Повний дуплексний"},
					{value:"100h", 	txt:"100M Напівдуплекс"},
					{value:"1000f", txt:"1000M Напівдуплекс"}	
				],
				wan1_select1:[
					{value:"auto", 	txt:"Автоматичний режим"},
					{value:"10f", 	txt:"10M Повний дуплексний"},
					{value:"10h", 	txt:"10M Напівдуплекс"},
					{value:"100f", 	txt:"100M Повний дуплексний"},
					{value:"100h", 	txt:"100M Напівдуплекс"},
					{value:"1000f", txt:"1000M Напівдуплекс"}	
				],
				wan1_select2:[
					{value:"auto", 	txt:"Автоматичний режим"},
					{value:"10f", 	txt:"10M Повний дуплексний"},
					{value:"10h", 	txt:"10M Напівдуплекс"},
					{value:"100f", 	txt:"100M Повний дуплексний"},
					{value:"100h", 	txt:"100M Напівдуплекс"},
					{value:"1000f", txt:"1000M Напівдуплекс"}	
				],
				internet_access_ipv4:[
					{value:"pppoe", 	txt:"Широкосмугова (PPPoE)"},
					{value:"dhcp", 	txt:"Автоматичне отримання (DHCP)"},
					{value:"static", 	txt:"Статична адреса"},	
						
				],
				internet_access_ipv4_russia:[
					{value:"pppoe", 	txt:"Широкосмугова (PPPoE)"},
					{value:"dhcp", 	txt:"Автоматичне отримання (DHCP)"},
					{value:"static", 	txt:"Статична адреса"},			
					{value:"pppoe_r", 	txt:"Dual AccessPPPoE"},	
					{value:"l2tp", 	txt:"L2TP/Dual AccessL2TP"},	
					{value:"pptp", 	txt:"PPTP/Dual AccessPPTP"},	
				],
				internet_access_ipv6:[
					{value:"dhcp", 	txt:"Автоматичне отримання)"},
					{value:"static", 	txt:"Статична адреса"},
					
				],
				ipv6_dns_select:[
					{value:"automatic", 	txt:"Автоматичне отримання"},
					{value:"manual", 	txt:"Ручна конфігурація"},
				],
				
				mppe_encryption:[
					{value:"0", 	txt:"закрити"},
					{value:"1", 	txt:"відкрити"},
				],
			},
			js:{
				"bridge":"Режим точки доступу"
			}
		},
		ipv6:{
			html:{
				"f-label":["Перемикач IPv6", "режим доступу до інтернету",
			"IP-адреса", "префікс IPv6", "типовий шлюб", "метод DNS", "улюблений DNS", "альтернативний DNS",],
				
				"prompt_text_ipv6":["(Необов’язково)","(Необов’язково)","(Необов’язково)","(Необов’язково)","(Необов’язково)"],
				"routing-mode-ipv6":["Автоматичне", "ручне з’єднання", "Автоматичне", "ручне з’єднання"]
			},
			select:{
				ipv6_dns_select:[
					{value:"automatic", 	txt:"Автоматичне налаштування"},
					{value:"manual", 	txt:"Ручні налаштування"},
				],
				internet_access_ipv6:[
					{value:"dhcp", 	txt:"Автоматичне налаштування"},
					{value:"static", 	txt:"Ручні налаштування"},
				],
			}
		},
		system_upgrade:{
			html:{
				"tab-item":["Ручне оновлення", "Онлайн оновлення"],
				"tip-sec":"Оновлення прошивки займає декілька хвилин, не вимикайте живлення!",
				"f-label":["Поточна версія","Обрати файл оновлення","Автоматичне оновлення до останньої прошивки","Автоматичне оновлення аварійної прошивки","автоматичне оновлення агента","Інформація про версію"],
				"view":"Перегляд",
				"reset_tip":"Маршрутизатор перезавантажується, не вимикайте живлення, почекайте трохи……",
				"version-status":["Поточна версія", " Остання версія"],
				
				"tipsText":["Підтримується автоматичне оновлення прошивки, щоб негайно отримувати нові функції, виправляти проблеми та підвищувати стабільність. Рекомендуємо вам увімкнути цю функцію. Коли ця функція увімкнена, маршрутизатор періодично проситиме нову прошивку на сервері і оновлюватиме прошивку в ранні години","Аварійна прошивка використовується для вирішення основних проблем безпеки і стабільності маршрутизатора, рекомендуємо вам увімкнути цю функцію. Коли вона увімкнена, маршрутизатор періодично проситиме нову прошивку на сервері і оновлюватиме екстрену прошивку в ранні години."]
			},
			
			
		},
		parameter_backup:{
			html:{
				"tab-item":["Резервна копія параметрів", "Відновлення параметрів"],
				"tip-sec":"Відновлення прошивки займе кілька хвилин, не вимикайте живлення!",
				"backup_title":["Збережіть поточні налаштування маршрутизатора у файл. ","Відновити налаштування маршрутизатора з файлу резервної копії."],
				"f-label":["","","Виберіть файли відновлення"],
				"view":"Перегляд",
				"reset_tip":"Маршрутизатор відновлюється, не вимикайте живлення, зачекайте...",
			},
		},
		tools:{
			html:{
				"in":["Сканувати зв'язок", "Перемкнути мову"]
			}
		},
		system:{
			html:{
				"in":["Перемкнути мову"]
			}
		},
		router_info:{
			html:{
//				"card-header":["Інформація про маршрутизатор","Спосіб доступу в інтернет IPv4 (<span id=\"online_info\"></span>)","Спосіб доступу в інтернет IPv6 (<span id=\"online_info_ipv6\"></span>)","Інформація про сімейну мережу"],
				"card-header":["Інформація про маршрутизатор","Інформація про доступ в Інтернет","Інформація про локальну мережу"],
				"txt":["Назва маршрутизатора:", "Бездротова частота передачі:", "Пам’ять:",
				"Метод доступу до Інтернету IPv4:","Зовнішня IP-адреса IPv4:","Найкраща адреса DNS IPV4:","Альтернативна адреса DNS IPV4:",

				//"Спосіб доступу в інтернет IPv4:","IP адреса зовнішньої мережі IPv4:","Адреса воріт IPv4:","IPv4 Адреса основного DNS:","IPv4 Адреса альтернативного DNS:",
				//"2.4G частота:","2.4G SSID:","SSID відвідувача:","Частоти 5G:","5G SSID:","SSID відвідувача:",
				"IPv 4 адреса маршрутизатора:","Маска підмережі:","IPv6 адреса маршрутизатора:","Стан сервера DHCP:","Діапазон пулу адрес DHCP:", "MAC -адреса LAN:"  ],
				
				"txt_ipv6":["Спосіб доступу в інтернет IPv6","Адресу зовнішньої мережі IPv6:","IPv6 префікс: ","WAN MAC адреса:","IPv6 Адреса переважного DNS:","IPv6 Адреса альтернативного DNS:",]
			},
			js:{
				"mode": ["Ширина", "Режим WiFi4", "Режим WiFi5", "Режим WiFi6",],
				"wisp":"Бездротовий режим (WISP)",
				"repeater":"Бездротовий повторювач",
				"bridge":"Режим точки доступу",
				"wan_status":["Стан порту WAN",""],
				"lan_status":["Стан порту LAN",""],
				"card_header":["Інформація в мережі WAN"],
				"ipv4_txt":["Спосіб доступу в інтернет IPv4:","IP адреса зовнішньої мережі IPv4:","Адреса воріт IPv4:","WAN MAC адреса:","IPv4 Адреса основного DNS:","IPv4 Адреса альтернативного DNS:"],
			}
		},
		indicator_light:{
			html:{
				"f-label":["Світлодіодний вимикач"]
			},
		},
		portMapping:{
			html:{
				"tab-item":["Віртуальний сервер","Налаштування DMZ"],
				"modal-title":"Новий порт-маппинг",
				"title":["Список віртуальних серверів"],
				"f-label":["Ім'я віртуальної служби","IP адреса хоста-комп'ютера внутрішньої мережі","Протокол","Зовнішній порт","Внутрішній порт","Стан DMZ","IP адреса хосту DMZ"]
			},
			select:{
				proto:[
					{value:"tcp", 	txt:"TCP"},
					{value:"udp", 	txt:"UDP"},
					{value:"tcp udp", 	txt:"TCP+UDP"},
					{value:"icmp", 	txt:"ICMP"},
					{value:"template", 	txt:"Вибір шаблон"}
				],
				external_port_template:[		
					{value:"tcp", 	txt:"HTTP"},
					{value:"tcp", 	txt:"HTTPS"},
					{value:"tcp", 	txt:"FTP"},
					{value:"tcp", 	txt:"POP3"},
					{value:"tcp", 	txt:"SMTP"},
					{value:"udp", 	txt:"DNS"},
					{value:"tcp", 	txt:"TELNET"},
					{value:"udp", 	txt:"IPSEC"},
					{value:"tcp", 	txt:"PPTP"},
					{value:"tcp", 	txt:"Віддалений робочий стіл Windows"},
					{value:"tcp", 	txt:"H.323 IP телефон"},
					{value:"tcp", 	txt:"SSH"},
					
				 ]
			},
			js:{
				"table-title":["Ім'я віртуальної служби","IP адреса хоста-комп'ютера внутрішньої мережі","Протокол","Зовнішній порт","Внутрішній порт","Операція"],
				"add":"Додати новий"
			}
		},
		oray_ddns:{
			html:{
				"f-label":["Стан служби динамічних доменних імен (DDNS)","Постачальник послуг доменних імен","Ім'я користувача","Пароль","Доменне ім'я","Інформація про стан"],
				"button_a":["Реєстрація"],
				"tips":["(Для доступу до Інтернету точка доступу повинна мати відкриту IP-адресу)"]
			},
			select:{
				orayName:[
					{value:"dyndns.org",txt:"www.dyndns.com"},
					{value:"no-ip.com",txt:"www.noip.com"},
					{value:"oray.com",txt:"www.oray.com"}
				]
			}
		},
		remoteAccess:{
			html:{
				"f-label":["HTTPS","Telnet","HTTP","FTP","SSH","Ping"],
				"f-port":"Порт",
				"f-label-title":["Локальна мережа","Інтернет","Локальна мережа","Інтернет","Локальна мережа","Інтернет","Локальна мережа","Інтернет","Локальна мережа","Інтернет","Локальна мережа","Інтернет"],
			},
		},
		wireless_universal_relay:{
			html:{
				"f-label":["WISP","SSID","пароль","статус з'єднання","SSID","пароль для з'єднання"],
				"wireless_txt":["бездротові мережі поблизу","прихований список","пошук Wi-Fi"],
			},
			js:{
				"table-title":["серійний номер","назва бездротової мережі","MAC-адреса", "канал","режим шифрування","сигнал","виконати"],
				"txt":["з'єднання","сканування бездротових мереж поблизу...","отримання бездротової мережі успішне"]
			}
		},
		wlan_mode:{
			html:{
				"title":"Вибір режиму",
				"f-label":["Поточний бездротовий режим","Будь ласка, використовуйте <a id='login_href' href='http://leike.cc'>leike.cc</a>", "Бездротове мережеве ім'я (SSID)", "Стан з’єднання", "доступ до SSID", "Пароль з’єднання"],
				"tip-sec":"Функція Mesh увімкнена, бездротовий режим не можна увімкнути одночасно",
				"wireless_txt":["Сховати список", "Пошук Wi-Fi"],
			},
			js:{
				"txt":["З'єднатися", "Пошук близьких бездротових мереж...", "Успішно отримана бездротова мережа"],
				hiddenSSID:"Hide Network",
				link:"з’єднатися",
				linked:"з’єднано",
				searching:"Пошук сигналів у процесі",
				tabTitle:["Бездротова назва", "шифрування", "Сила сигналу", "операція"],
				linkStatus:{
					"LinkOK":"З’єднання успішне",
					"Linking":"З’єднання……",
					"LinkFail":"З’єднання не було успішним",
					"NotLink":"Не з’єднано"
				},
				linkCompleteTips:"<li>Режим повторювання бездротового реле може призвести до відключення вашого пристрою від маршрутизатора, будь ласка, перепідключіть бездротову мережу</li>",
				parentManagementTips:"Режим бездротового реле може призвести до неефективності функції батьківського керування",
				wifiName:"назва бездротової мережі",
				wifiPwd:"пароль бездротової мережі",
				ssidSynchronizationFailed:"Спроба синхронізації ssid зазнала невдачі, будь ласка, спробуйте ще раз пізніше",
				wifiPwdChecking:"Перевірка пароля",
				wifiPwdCheckSuccess:"Успішна відповідність пароля",
				wifiPwdCheckError:"Неправильний пароль, будь ласка, введіть повторно",
				routerDesc:"У цьому режимі маршрутизатор може надати доступ до інтернету для декількох дротових і бездротових пристроїв.",
				apDesc:"У цьому режимі точка доступу змінює існуючу дротову мережу на бездротову мережу.",
				repeaterDesc:"У цьому режимі точка доступу підвищує існуюче бездротове покриття у вашому будинку.	",
				wispDesc:"Ділити з’єднання з Інтернетом у будь-якій існуючій відкритій Wi-Fi мережі. Наприклад, готелі.",
			},
			select:{
				wlan_mode:[
					{value:"2", 	txt:"Режим бездротової маршрутизації"},
					{value:"3", 	txt:"Режим точки доступу"},
					{value:"1", 	txt:"Режим розширення діапазону"},
					{value:"0", 	txt:"Режим WISP"}
				]
			},
			button:{
				"btn-refresh":"сканування Wi-Fi",
				"btn-link":"з’єднатися"
			}
		},
		restart_regularly: {
		html:{
				"modal-title":"Часовий розклад",
				"title":"Часовий список розкладів",
				"f-label":["Перемикач часу","Час закриття","Дата закриття"],
				"active":["Sun.","Mon.","Tue.","Wed.","Thu.","Fri.","Sat."],
				
			},
			select:{
				type:[
					{value:"reboot", txt:"Часове перезавантаження"},
					{value:"wifi", txt:"Часове вимкнення WiFi"},
					{value:"led", txt:"Світло індикатора вимкнення часу"}
				]
			},
			js:{
				add:"Нове додавання",
				
				start_time:"початковий час",
				end_time:"Час завершення",
				
				"table-title":["Тип плану", "дата", "час", "операція"]
			}
		}, 

		wps:{
			html:{
				"f-label":["WPS","PIN код"],
				"input_pin_button":"Утворити новий код PIN"
			}
		},
		developer:{
			html:{
				
				"f-label":["Поріг фрагментації","Поріг RTS","Дротовий кадр","Область безпровідної мережі","Режим агрегації кадрів","UPnP","апаратне прискорення"],
				"tipsText":["Будьте обережні зі змінами! Переконайтеся, що ваш вибір відповідає місцевим нормам!"]
			},
			select:{
				
				wireless_preamble_2g_sel:[
					{value:"0", 	txt:"Довгий кадр"},
					{value:"1", 	txt:"Короткий кадр"}
				],
				wireless_Network_area:[
					{value:"1", 	txt:"Китай"},
					{value:"2", 	txt:"США"},
					{value:"3", 	txt:"Європа"},
					{value:"4", 	txt:"Росія"},
					{value:"5", 	txt:"Бангладеш"},
					{value: "6", txt: "Малайзія"}
					
				]
			}
		},
		pptp_client:{
			html:{
				"tab-item":["Параметри клієнта PPTP", "Стан клієнта PPTP"],
				"f-label":["Стан запуску", "Адреса сервера", "Порт сервера", "Назва користувача", "Пароль", "Чи локальний рух проходить через VPN", "Увімкнути шифрування"],
				"title":["Список параметрів клієнта PPTP", "Список стану клієнта PPTP"],
				"prompt_text":["(Можна ввести назву домену і IP-адресу)"]
			},
			js:{
				"table_title":["Серійний номер", "Стан", "Адреса сервера", "порт", "Імя користувача", "Пароль", "Операція"],
				"txt":["Змінити", "Вилучити", "Вилучено успішно", "Змінено успішно", "Сегмент мережі IP", "Один вузл"],
				"table_title_state":["Серійний номер", "Ім'я користувача", "Стан з'єднання", "Локальна адреса IP", "Адреса IP колеги", "Операція"],
			},
			
		},
		l2tp_client:{
			html:{
				"tab-item":["Параметри клієнта L2TP", "стан клієнта L2TP"],
				"f-label":["Стан запуску", "Адреса сервера", "Ім'я користувача", "Пароль", "Чи локальний рух проходить через VPN"],
				"title":["Список параметрів клієнта L2TP", "Список стану клієнта L2TP"],
				"prompt_text":["(Можна ввести назву домену і IP-адресу)"]
			},
			js:{
				"table_title":["Серійний номер", "Стан", "Адреса сервера", "Ім'я користувача", "Пароль", "Операція"],
				"txt":["Змінити", "Вилучити", "Вилучено успішно", "Змінено успішно", "Сегмент мережі IP", "Один вузл"],
				"table_title_state":["Серійний номер", "Ім'я користувача", "Стан з'єднання", "Локальна адреса IP", "Адреса IP колеги", "Операція"],
			},
			
		},
		access_control:{
			html: {
				"f-label": ["назва пристрою", "метод планування","час","час","час",
				"Протокол", "Назва", "режим", "джереловий IP", "джереловий порт", "призначений IP", "призначений порт", "метод планування",
				"Адреса URL", "Метод планування", "Фільтрування URL", "Режим фільтрування"],
				"tab-item":["Фільтрування MAC", "Фільтрування порту", "Фільтрування URL"],
				"active": ["Sun.","Mon.","Tue.","Wed.","Thu.","Fri.","Sat.",],
				
				"title":["Контроль доступу"],
				"tip-sec":["Якщо буде позначено режим білого списку, будь ласка, спочатку додайте локальну адресу MAC, інакше ви не зможете отримати доступ до мережі."],
				"tab-item-a":["Фільтрування MAC", "Фільтрування порту", "Фільтрування URL"],
				"modal-title":"Додати правило",
				"title":["список назв","список назв","список назв"],
				"f-lbl-text":["Година","гілка","Година","гілка"],
				"day":["Mon.","Tue.","Wed.","Thu.","Fri.","Sat.","Sun.",],
				},
			js: {
				"table-title": ["Серійний номер", "Назва пристрою", "Інформація про мережу", "Schedule Type", "Time", "Операція"],
				"table-title_2": ["Серійний номер", "Назва пристрою", "IP", "MAC", "Вибір"],
				"txt": ["відкрити", "закрити", "редагувати", "видалити", "Кожного дня", "показувати офлайн-пристрої"],
				sec_title:["Білий список","список назв"],
				mac_tab_title:["Адреса MAC", "Тип планування", "Час", "Операція"],
				port_tab_title:["Name", "Protocol", "Source IP", "Source Port", "Destination IP", "Destination Port", "Schedule Type", "Time", "Operation"],
				url_tab_title:["Адреса URL", "тип розкладу", "час", "дія"],
				accept:"дозволити",
				drop:"відмовитися",
				add:"Додати новий",
				copywriting:["Sun.","Mon.","Tue.","Wed.","Thu.","Fri.","Sat.","Кожного дня",'Always','Disable'],	
				day_name:["Mon.","Tue.","Wed.","Thu.","Fri.","Sat.","Sun.",],
				time:"час",
				data_name:"час",
				start_time:"початковий час",
				end_time:"Час завершення",
				min:"Година",
				sec:"секунда",
				"day_not_null":"Будь ласка, виберіть принаймні одну дату",
				"time_equal":"Час початку не може дорівнювати кінцевому часу",
				"endLtStart":"Час кінця не може бути меншим за час початку",
			},
				select:{
					proto:[
						{value:"TCP", 	txt:"TCP"},
						{value:"UDP", 	txt:"UDP"},
						{value:"TCPUDP", 	txt:"TCP+UDP"},
						{value:"ICMP", 	txt:"ICMP"},
						{value:"ANY", 	txt:"ANY"}
					],
					mode:[
						{value:"drop", 	txt:"відмовитися"},
						{value:"accept", 	txt:"дозволити"}
					],
					mac_schedulesType:[
						{value:"0", txt:"Always"},
						{value:"1", txt:"Schedules"},
						{value:"2", txt:"Disable"}
					],
					port_schedulesType:[
						{value:"0", txt:"Always"},
						{value:"1", txt:"Schedules"},
						{value:"2", txt:"Disable"}
					],
					url_schedulesType:[
						{value:"0", txt:"Always"},
						{value:"1", txt:"Schedules"},
						{value:"2", txt:"Disable"}
					],
			} 
		},
		policy_routing: {
			html: {
				"f-label": ["Назва правила", "Пріоритет", "Джерело джерела", "IP-адреса", "Маска підмережі", "Хост призначення", "IP-адреса", "Маска підмережі","Назва домену",  "вихід"] ,
				"tishi": ["Чим менше число, тим вище пріоритет"],
			},
		js: {
			"title_txt": ["Будь ласка, введіть пріоритет", "Будь ласка, введіть номер між 0-32767","Будь ласка, введіть правильний пріоритет ", "Будь ласка, виберіть вихід ","Цей пріоритет вже існує"],
			"table_title": ["Серійний номер", "Назва правила", "Пріоритет", "Джерело джерела", "Хост призначення", "Вихід", "Операція"],
			"txt":["Змінити", "вилучити", "успішно вилучити", "успішно змінити"],
		},
		select: {
			wan_host_flag: [
				{value: "all", txt: "all hosts"},
				{value: "sub_host", txt: "Host Subnet"},
				{value:"dns", txt:"Назва домену DNS"},
			],
		lan_host_flag: [
				{value: "all", txt: "all hosts"},
				{value: "sub_host", txt: "Host Subnet"},
				],
			},
		},
		static_routing:{
			html:{
				"f-label":["Тип", "адреса призначення", "маска", "ворота"],
			},
			js:{
				"table_title":["Серійний номер", "тип", "адреса призначення", "маска", "ворота", "операція"],
				"txt":["Змінити", "вилучити", "успішно вилучити"," успішно змінити", "секмент мережі IP", "один вузол"],
			},
			select:{	
				static_flag:[
					{value:"NET", txt:"Сегмент мережі IP"},
					{value:"HOST", txt:"Один вузол"},
				],
			},
		},
		iptv:{
			html:{
			
				"f-label":["Стан IPTV","IGMP snooping","IGMP proxy",
				"Порт IPTV","ІД Інтернету VLAN","Пріоритет VLAN","ІД IPTV VLAN","Пріоритет IPTV","ІД IP телефону VLAN","Пріоритет IP-телефону","параметри порту","LAN1","LAN2","LAN3","LAN4"],
				"prompt_text":"Заповнити 0-4094, 0 означає закрито",
				'tipsText':["Пересунути вказаний порт IPTV до порту WAN"]
			},
			select:{	
				iptv_table:[
					{value:"off", txt:"закрити"},
					{value:"bridge", txt:"перемикання"},
					{value:"vlan", txt:"VLAN"}
				],
				port_iptv:[
					
					{value:"1", 	txt:"LAN1"},
					{value:"1,2", 	txt:"LAN1 і LAN2"}
					
				],
				vlan_priority:[
					{value:"0", 	txt:"0"},
					{value:"1", 	txt:"1"},
					{value:"2", 	txt:"2"},
					{value:"3", 	txt:"3"},
					{value:"4", 	txt:"4"},
					{value:"5", 	txt:"5"},
					{value:"6", 	txt:"6"},
					{value:"7", 	txt:"7"},
				],
				iptv_priority:[
					{value:"0", 	txt:"0"},
					{value:"1", 	txt:"1"},
					{value:"2", 	txt:"2"},
					{value:"3", 	txt:"3"},
					{value:"4", 	txt:"4"},
					{value:"5", 	txt:"5"},
					{value:"6", 	txt:"6"},
					{value:"7", 	txt:"7"},
				],
				ip_phone_priority:[
					{value:"0", 	txt:"0"},
					{value:"1", 	txt:"1"},
					{value:"2", 	txt:"2"},
					{value:"3", 	txt:"3"},
					{value:"4", 	txt:"4"},
					{value:"5", 	txt:"5"},
					{value:"6", 	txt:"6"},
					{value:"7", 	txt:"7"},
				],
				
				select_lan1:[
					{value:"vlan_lan", 	txt:"Інтернет"},
					{value:"vlan_iptv", 	txt:"IPTV"},
					{value:"vlan_voip", 	txt:"IP телефон"},
				],
				select_lan2:[
					{value:"vlan_lan", 	txt:"Інтернет"},
					{value:"vlan_iptv", 	txt:"IPTV"},
					{value:"vlan_voip", 	txt:"IP телефон"},
				],
				select_lan3:[
					{value:"vlan_lan", 	txt:"Інтернет"},
					{value:"vlan_iptv", 	txt:"IPTV"},
					{value:"vlan_voip", 	txt:"IP телефон"},
				],
				select_lan4:[
					{value:"vlan_lan", 	txt:"Інтернет"},
					{value:"vlan_iptv", 	txt:"IPTV"},
					{value:"vlan_voip", 	txt:"IP телефон"},
				],
			}
		},
		signal_conditioning:{
			html:{
				"current_bt":["Низький", "середній", "високий"]
			}
		},
		timeSetting:{
			html:{
				"f-label":["Поточний системний час","Спосіб отримання системного часу","Часовий пояс","Список серверів","Дата","Час"],
				"f-lbl-text":["Рік","Місяць","День","година","хвилина","секунда"],
				"radio-txt":["NTP (онлайн отримання)","Ручна конфігурація"],
				"domain_name_txt":["Доменне ім'я"]
			},
			select:{			
				time_zone_sel:[
					{value: "-14", txt: "(GMT+14: 00) Острови Ліна"},
					{value: "-13", txt: "(GMT+13: 00) Острови Фенікса"},
					{value: "-12:45", txt: "(GMT+12: 45) Чатемські острови"},
					{value: "-12", txt: "(GMT+12: 00) Веллінгтон"},
					{value: "-11", txt: "(GMT+11: 00) Хоніара"},
					{value: "-10:30", txt: "(GMT+10: 30) Острови Лорда Хау"},
					{value: "-10", txt: "(GMT+10: 00) Канбера"},
					{value: "-9:30", txt: "(GMT+09: 30) Центральна Австралія"},
					{value: "-9", txt: "(GMT+09: 00) Токіо"},
					{value: "-8", txt: "(GMT+08: 00) Пекін"},
					{value: "-7", txt: "(GMT+07: 00) Бангкок"},
					{value: "-6:30", txt: "(GMT+06: 30) М'янма"},
					{value: "-6", txt: "(GMT+06: 00) Дакка"},
					{value: "-5:45", txt: "(GMT+05: 45) Непал"},
					{value: "-5:30", txt: "(GMT+05: 30) Індія"},
					{value: "-5", txt: "(GMT+05: 00) Ісламабад"},
					{value: "-4:30", txt: "(GMT+04: 30) Афганістан"},
					{value: "-4", txt: "(GMT+04: 00) Абу-Дабі"},
					{value: "-3:30", txt: "(GMT+03: 30) Іран"},
					{value: "-3", txt: "(GMT+03: 00) Москва"},
					{value: "-2", txt: "(GMT+02: 00) Афіни"},
					{value: "-1", txt: "(GMT+01: 00) Берлін"},
					{value: "0", txt: "(GMT0) Лондон"},
					{value: "1", txt: "(GMT-01: 00) Ponta Delgada"},
					{value: "2", txt: "(GMT-02: 00) Вашингтон"},
					{value: "3", txt: "(GMT-03: 00) Бразиліа"},
					{value: "3:30", txt: "(GMT-03: 30) Ньюфаундленд"},
					{value: "4", txt: "(GMT-04: 00) Каракас"},
					{value: "5", txt: "(GMT-05: 00) Нью-Йорк"},
					{value: "6", txt: "(GMT-06: 00) Мехіко"},
					{value: "7", txt: "(GMT-07: 00) Солт-Лейк-Сіті"},
					{value: "8", txt: "(GMT-08: 00) Лос-Анджелес"},
					{value: "9", txt: "(GMT-09: 00) Юнона"},
					{value: "9:30", txt: "(GMT-09: 30) Маркізькі острови"},
					{value: "10", txt: "(GMT-10: 00) Гонолулу"},
					{value: "11", txt: "(GMT-11: 00) Острів Мідвей"},
					{value: "12", txt: "(GMT-12: 00) Маджуро"} 
				]
			}
		},
		dial_up_log:{
			html:{
				title:"Журнал набору номера"
			}
		},
		captive_portal:{
			html:{
				"f-label":["Captive Portal enable","ISP","NAS ID","UAM SECERT","вибір інтерфейсу",
				"Local Network","Captive Portal URL","UAM Server","UAM Secret","RADIUS server 1","RADIUS server 2","RADIUS Secret","RADIUS NAS ID","RADIUS location name","RADUS location lD",
				"Preferred DNS","Alternate DNS","Leasetime","CoA Port","UAM Allowed","UAM Domain",
	"Список білих пристроїв","","Назва пристрою","MAC","Назва пристрою"],
				"routing-mode":["Виберіть онлайн- пристрої","Ручно додавання пристроїв"],
				"prompt_text":"Після активації пристрої, додані до списку білих, не потребують автентифікації Captive Portal (підтримуються до 32 пристроїв)",
				"title":"список назв",
				"tipsText":"Нагадування: нове додавання до білого списку вимагає перезапуску WiFi або перез’ єднання з інтернетом",
				"f-label-title":["Головний SSID", "гостей SSID"],
				"portal_optional":"（Додатковий）",
				"portal_time":"(годин)"
			},
			select:{	
				isp:[
					{value:"wifisystem", 	txt:"WIFISYSTEM"},
					{value:"hotspotsystem", 	txt:"HOTSPOTSYSTEM"},
				]
			},
			js:{
				"add_button":["Додати пристрій","Назва пристрою","MAC"],
				"device_whitelist_table":["<input type='checkbox' name='checkboxShall'  value='0' class='checkboxShall select_all'>Вибрати всі","Назва пристрою","MAC"],
			"devices_online_table":["<input type='checkbox' name='checkboxShall'  value='0' class='checkboxShall select_all'>Вибрати всі","інтерфейс","Назва пристрою","MAC"],
						
			},
		},
		changePassword:{
			html:{
				"f-label":["Новий пароль", "Підтвердження пароля"],
				"tip-sec":"Пароль адміністратора використовується для входу в маршрутизатор, збережіть свій пароль!"
			}
		},
		factory_settings:{
			html:{
				"tip-sec":"Усі параметри конфігурації, збережені маршрутизатором, будуть видалені, щоб відновити маршрутизатор в початковий стан. Вам треба отримати доступ до мережі після повторного налаштування.",
				"reset_tip":"Маршрутизатор перезавантажується, не вимикайте живлення, почекайте трохи……"
			}
		},
		restart_router:{
			html:{
				"tip-sec":"Система маршрутизатора буде негайно перезапущена",
				"reset_tip":"Маршрутизатор перезавантажується, не вимикайте живлення, почекайте трохи……"
			}
		},
		network_firewall:{
			html:{
				"tab-item":["IP/MAC binding", "ARP monitoring"],
				"monitor_ip_title":["IP/MAC зв'язка", "ARP attack defense", "IP/MAC зв'язковий список", "ARP monitoring"],
			
				"prompt_text":["(Необов'язково)", "Пакети/Друга", "(1-10)"],
				"arp_information":["Всі інформації ARP", "Внутрішня інформація ARP", "Зовнішня інформація APR"],
				"checkbox_lb":["(Рекомендується увімкнути лише лажка ARP у внутрішній мережі)"],
				"f-label":["IP address", "MAC address", "Remarks", "Interface", "ARP attack defense", "Sending free broadcast ARP", "Preventing IP/MAC from being stolen"],
				
			},
			js:{
				"table-title-ip":["Серійний номер", "IP адреса", "адреса MAC", "джерело правил", "інтерфейс", "Зауваження", "операція"],
				"arp_table_thead":["Серійний номер", "Назва вузла", "IP адреса", "адреса MAC", "Тип", "Інтерфейс", "Стан", "Операція"],
				"txt":["Edit", "Delete", "Manual Add", "Delete Successfully", "Modify Successfully", "Static", "Dynamic", "Unbound", "Bound", "Bind", "Unbind", "Unknown"],
			},
			select:{
				firewall_interface:[
					{value:"LAN", txt:"LAN"},
				],
			}
		},
		mesh_pair:{
			html:{
				"tab-item":["Діаграма топології мережі","Парування мереж"],
				"title_h4":["Пошук мережі мережі",
							"Немає мережі мереж",
							"будь-ласка, виберіть спосіб додавання нового вузла мережі","примітка: вузловий пристрій повинен знаходитися у стані ініціалізації","помістіть вузол у відповідне положення",
							"Слід розмістити на відкритому місці якомога далі","розміщуйте великі електричні прилади якомога далі та зменшуйте вплив перешкод",
							"Увімкніть новий вузловий пристрій та дочекайтеся увімкнення індикатора системи.",
							"Натисніть кнопку WPS на вузловому пристрої та дочекайтеся мережевого сполучення.","У той же час натисніть кнопку WPS з пристроями шлюбів і вузлів, щоб чекати на парування мережі ",
							"Будь-ласка, трохи зачекайте під час пошуку нового вузла <span id=\"countDown\">120</span>",
     						"новий вузол додано успішно", "новий вузол не знайдено, можливі причини" ,
     						"1. Новий вузловий пристрій не увімкнено <br/> 2. Не натиснули кнопку WPS нового вузла < br / > 3. Будь-ласка, розмістіть новий вузловий пристрій ближче до шлюзу та спробуйте ще раз",
     						"1. Новий вузловий пристрій не увімкнено <br/> 2. Будь-ласка, розмістіть новий вузловий пристрій ближче до шлюзу та спробуйте ще раз",
							"Підключіть порт LAN < span class = \tipstext\"> до шлюзу через порт WAN < span class=\"tipsText\"> вузлового  пристрою за допомогою мережевого кабелю",
							"Пошук стільникової мережі",
							"Вільна стільникова мережа",],
				"modal-title":["Змінити назву пристрою","Список пристроїв"],
				"prompt_text":"Перегляд мережевих методів",
					"f-label":"Назва пристрою"
			//	"f-label":["EasyMesh Networking", "Networking Role Selection","Поточна роль", "Wireless Networking Links","назва пристрою"]
				
			},
			select:{	
				wps_mesh_select:[
					{value: "0", txt: "Додати Mesh агент через кнопку WPS"},
					{value: "1", txt: "провідне з'єднання"},
					
				],
				wps_second_choice:[
					{value: "0", txt: "натісніть кнопку WPS Mesh точки доступу"},
					{value: "1", txt: "одночасно натісніть кнопку WPS на Mesh агенті та контролері"},
				],
		deviceRole:[
					{value:"0", txt:"Always"},
					{value:"1", txt:"Головний маршрутизатор( контролер)"},
					{value:"2", txt:"Підмаршрутизатор( агент)"},
				],
				mesh_prio:[
					{value:"5G/2.4G", txt:"5G/2.4G"},
					{value:"5G", txt:"5G"},
					{value:"2.4G", txt:"2.4G"},
				],
			},
			js:{
				node:["ворота","вузол"],
				view_more:"Більше обладнання",
				link_mode:["Дротовий", "бездротовий"],
				current_role:["Ідентифікування... ", "Головний маршрутизатор( контролер) "," Підмаршрутизатор( агент) "],
				tab_title:["Назва пристрою", "MAC", "спосіб з'єднання", "потужність сигналу", "операція"],
				name_not_null:"Ім'я пристрою не може бути порожнім"
			}
		},
		speed_test:{
		   html:{
			   	speed_unit:"Mbps",
				speed_testing:"Швидкість перевірки ...",
				name:["Ping","Jitter"],
				speed_txt:["Звантажити","Вивантажити"],
			   	btn:["GO","Test Again"],
				"modal-title":"Select Server",
				privacy_link:"Privacy Policy"
			},
		   js:{
			"table-title":["Назва сервера", "Час", "Швидкість завантаження/Витрата швидкості", "Ping/Jitter"],
			"getting_list":"Отримання списку серверів...",
			"get_list_error":"Спроба отримання зазнала невдачі, будь ласка, спробуйте ще раз",
			"testErr":"Спроба виміру швидкості зазнала невдачі",
			"privacy":"Ookla може збирати певні ідентифіковані дані під час тесту, наприклад, вашу IP-адресу, і може поділитися цими даними з вибраними третіми сторонами. Для докладніших відомостей щодо збирання і того, як ми ними можем ділитися, будь ласка, перегляньте <a href='//www.speedtest.net/privacy'>Privacy Policy</a>."
		   }
		},
		wisp:{
			html:{
				"f-label":["Бездротовий передач", "доступ до SSID", "Стан з'єднання", "Ім'я бездротової мережі (SSID)", "Пароль бездротової мережі"],
				"tip-sec":"Функція EasyMesh увімкнена, бездротовий ретранслятор не може бути увімкнено одночасно",
				"title":["Бездротовий мережевий ретранслятор успішний", "Бездротовий мережевий ретранслятор зазнав невдачі"],
				"modal-title":"Параметри бездротового реле",
				"describe":["Якщо ви зараз використовуєте бездротову мережу для доступу до точки доступу","Будь ласка, вручну з’єднайтесь <span id=\"link-info\"></span>Бездротова мережа"],
				"suggestion":"Будь ласка, спробуйте наступні методи：",
				"err_des":["Будь ласка, перевірте, чи правильно введено верхній пароль", "Будь ласка, перевірте, чи бездротова відстань занадто довга або сигнал занадто поганий", "Будь ласка, перевірте, чи верхній пристрій працює правильно"]
			},
			js:{
				linkStatus:{
					"LinkOK":"З’єднання успішно",
					"Linking":"З’єднання……",
					"LinkFail":"не вдалося з’єднатися",
					"NotLink":"Не з’єднано"
				},
				create:"Бездротовий AP успішно створено",
				extend:"Розширення бездротової мережі успішно",
				ap_ssid_2G:"SSID(2.4GHz)",
				ap_ssid_5G:"SSID(5GHz)",
				repeater_ssid_2G:"Назва бездротового розширювача(2.4GHz)",
				repeater_ssid_5G:"Назва бездротового розширювача(5GHz)",
				hiddenSSID:"Сховати мережу",
				link:"з’єднатися",
				linked:"З’єднано",
				tabTitle:["Бездротова назва", "шифрування", "Сила сигналу", "операція"],
				searching:"Пошук сигналів у процесі",
				extending:"Процес розширення сигналу, будь ласка, зачекайте",
				extendSuc:"Розширення сигналу успішно",
				extendErr:"Перший пароль бездротової мережі неправильний, будь ласка, введіть його знову",
				wifiInfo:"Верхня інформація бездротової мережі",
				ssidInfo:"Ми розширимо для вас<span id=\"ssid-name-wrapper\">'<b id=\"ssid-name\"></b>'</span>Бездротова мережа",
				extendWifiInfo:"Розширена інформація бездротової мережеві",
				wifiPwd:"Пароль бездротової мережі",
				wifiName:"Назва бездротової мережі",
				wifi2GName:"2.4GHz Назва мережі",
				wifi5GName:"5GHz Назва мережі",
				isSame:"Пароль є тим самим, що і у найвищої бездротової мережі",
				isHand:"Пароль є тим самим, що і у найвищої бездротової мережі",
				wpa3NotSupport:"WPA3 Зараз не підтримується",
				wepNotSupport:"WEPЗ Зараз не підтримується"
			},
			button:{
				"btn-refresh":"Сканувати Wi-Fi",
				"btn-link":"з’єднатися"
			}
		},
		openvpn_server:{
			html:{
				"title":["OpenVPN","Сертифікат","Файл конфігурації"],
				"tab-item-a":["Налаштування сервера OpenVPN","Підключення OpenVPN"],
				"f-label":["OpenVPN","Тип сервісу","Порт сервісу","VPN підмережа","Маска мережі","Доступ клієнта"]
			},
			js:{
				"enableFail":"Клієнт було запущено, активація сервера не вдалася",
				"export-status":["Експорт файлу", "Помилка експорту"],
				"rsa—status":["Генерація сертифіката, будь ласка, зачекайте...", "Сертифікат успішно згенеровано", "Помилка генерації сертифіката"],
				"table-title":["Віддалена IP", "Призначений IP"]
			},
			select:{
				openvpn_server_type:[
					{value:"udp", txt:"UDP"},
					{value:"tcp", txt:"TCP"}				
				],
				openvpn_server_internet:[
					{value:"1", txt:"Інтернет і домашня мережа"},
					{value:"0", txt:"Тільки домашня мережа"}
				]
			}
		},
		openvpn_client:{
			html:{
				"title": "Список серверів",
				"modal-title": "Додати файл конфігурації",
				"f-label": ["Опис", "Ім'я користувача", "Пароль", "IP/Домен сервера", "Файл конфігурації"],
				"view":"Перегляд"
			},
			js:{
				"itemExist":"Цей екземпляр клієнта вже існує",
				"enableFail":"Сервер було запущено, активація клієнта не вдалася",
				"table-title": ["Опис", "Стан", "Увімкнено", "Дія"],
				"upload-status": ["Помилка конфігураційного файлу", "Помилка завантаження", "Конфігураційний файл не може бути порожнім"],
				"connect-status": ["Не підключено","Підключено","З'єднання......"],
				"add":"Додати новий"
			}
		},
		wireguard_server: {
			html: {
				"title": ["Налаштування сервера", "Список клієнтів"],
				"f-label": ["Wireguard", "Адреса інтерфейсу", "Порт", "Публічний ключ", "Мережа доступу", "Опис", "Публічний ключ", "Адреса інтерфейсу"],
				"generate_key": "Згенерувати ключ",
				"modal-title": "Додати новий список клієнтів",
				"optional_text": "(Необов'язково)"
			},
			js: {
				"enableFail": "Клієнт увімкнено, не вдалося активувати сервер",
				"add": "Додати",
				"table-title": ["Опис/Публічний ключ", "Адреса інтерфейсу", "Статистика швидкості", "Дії"]
			},
			select: {
				access: [
					{ "value": "2", "txt": "Інтернет" },
					{ "value": "0", "txt": "Домашня мережа" },
					{ "value": "1", "txt": "Інтернет та домашня мережа" }
				]
			}
		},
		wireguard_client: {
			html: {
				"title": ["Налаштування клієнта", "Параметри сервера"],
				"f-label": ["Wireguard", "Адреса інтерфейсу", "Публічний ключ", "Дозволені адреси", "Порт", "Адреса мережі", "Публічний ключ"],
				"generate_key": "Згенерувати ключ"
			},
			js: {
				"enableFail": "Сервер увімкнено, не вдалося активувати клієнта"
			},
			select: {
				allowed_ips: [
					{ "value": "0", "txt": "Всі" },
					{ "value": "1", "txt": "Користувацький" }
				]
			}
		},
    	network_4g:{
			html:{
				"tab-item-a":["Налаштуванняя мережі 4G","Статус мережі 4G"],
				"f-label":["Мережа 4G","PIN код","Код Pin залишається часом","APN","3G UMTS","4G LTE",
				"",
				"Оператор","Сила сигналу","Статус SIM-картки","IMEI","IMSI","Статус підключення","Тип мережі","IP-адреса","DNS, якій надають перевагу","Альтернативна DNS","MAC-адреса",
				"MCC","MNC","RSRQ","RSRP","RSRP","EARFCN","EARFCN","PCI","PSC","RAC","SINR","ECIO","CELLID","SMSC","BANDA",
				],
				"band_name":["Band 1","Band 8","Band 1","Band 3","Band 7","Band 8","Band 20","Band 38","Band 40","Band 41",],
				"3g_band8_ti":["Виберіть принаймні один діапазон частот 3G"],
				"4g_band8_ti":["Виберіть принаймні один діапазон частот 4G"],
			}
		},
		network_mode_4g:{
			html:{
				"f-label":["Режим мережі", "Мобільна мережа"],
			},
			select:{
				mode3g4gonly:[
					{value:"0", 	txt:"AUTO"},
					{value:"2", 	txt:"3G"},
					{value:"3", 	txt:"4G"}
				],
				usb3gOperManual:[
					{value:"0", 	txt:"AUTO"},
					{value:"1", 	txt:"Ручний"}
				]
			},
			js:{
				"table_title":["ID","Operator","MCC/MNC", "Velocity", "Condition", "Операція"],
				"label-title":["Пізніше, обробка SMS","Дозволено","Пошук","Пошук успішний"],
				"btn":["Почати виявлення","Скасувати передавання","з’єднатися"]
			}
		},
		sms:{
			html:{
				"tab-item-a":["Вхідний список", "Вихідний список", "Контактний список"],
				"modal-title":"SMS",
				"title":["Вхідний список<span id='Message_index'></span>","Вихідний список","Чортири "],
				"f-label":["отримувач","вміст","Status","отримувач","отримувач","Content","дата","отримувач","дата","Content"]
			},
		
			js:{
				"table-title":["Ідентифікатор", "стан повідомлення", "відправник", "вміст", "дата", "Операція"],
				"outbox-table-title":["ІД", "отримувач", "вміст", "дата", "Операція"],
				"add":"Додати",
				"sms_status":["Непрочитано", "Читання", "Отримувач", "Вміст", "Надіслання...", "Надіслання успішно", "Надіслання зазнало невдачі", "Надіслання","Подробиці"],
				"hint_language":["Вміст не може перевищити 153 символів","Збирання SMS повідомлень"]
				
			}
		},
		vpn:{
			html:{
				"f-label":["Перейти через PPTP","Перейти через L2TP","Перейти через IPSEC","Перейти через SIP"],
			},
		
		},
    },
	//js Текст, надрукований у файлі Помилкове нагадування Меню
	JS:{
		CIDRFormatInvalid: "Невірний формат CIDR",
		PrefixLengthShouldBeNumber: "Довжина префікса повинна бути числом",
		PrefixLengthRangeInvalid: "Довжина префікса повинна бути від 0 до 32",
		Base64CharacterSetInvalid: "Кодування Base64 дозволяє лише літери (великі та малі), цифри, `+`, `/` та `=`",
		Base64LengthInvalid: "Довжина рядка Base64 повинна бути кратною 4.",
		Base64PaddingInvalid: "Кількість символів заповнювача `=` в рядку Base64 не повинна перевищувати двох.",
		PublicKeyFormatInvalid: "Невірний формат публічного ключа",
		//
    add:"Додати",
jump_page:"Перейти до вказаної кількості сторінок",
select_all_page:"Виберіть всю сторінку",
copywriting:"Налаштовано",
copywriting_no:"Не налаштовано",
    	wireless_terminal_list:"Wireless terminal list",
		wireless_terminal:"Бездротовий термінал",
		networking_equipment:"З’єднані пристрої",
		host_list:"Список інтернет-вузлів",
		t_bridge:"Режим мосту",
		t_routing:"Режим маршруту",
		input_range:"Будь ласка, введіть діапазон правильно",
    	day_not_null:"Будь ласка, виберіть принаймні одну дату",
		time_equal:"Час початку не може дорівнювати кінцевому часу",
		endLtStart:"Час кінця не може бути меншим, ніж час початку",
		interface_bound:"Зв’язано з інтерфейсом",
		pageInit: "Завантаження...",
		paramGetErr: "Не вдалося отримати параметр",
		netErr:"Спроба з'єднання з мережею зазнала невдачі",
		errCode: "Error Code:",
    	on_line:"онлайн",
		offline:"вимкнено",
		errInfo: "Вміст помилки:",
		data_already_exists:"Дані вже існують",
		add_err:"Не вдалося додати",
		add_suc: "Додавання успішне",
		del_err:"Спроба вилучення зазнала невдачі",
		del_suc:"Удалося вилучити ",
		modify_err:"Спроба зміни зазнала невдачі ",
		modify_suc: "Зміни успішні",
		log_null:"Ім’я користувача або пароль порожній, будь ласка, спробуйте ще раз",
		log_title:"Ім’я користувача або пароль погано, будь ласка, спробуйте ще раз.",
		loginErr:"Ваші неправильні спроби входу до системи досягли три рази, система затримує перевірку.",
		deleting:"Вилучення",
		unbinding:"Незв'язання",
		unbinding_succeeded:"Вилучено успішно",
		binding_succeeded:"Прив’язка успішна ",
		binding_error:"Спроба прив’язки зазнала невдачі",
		setting_succeeded:"Успішно встановлено",
		binding:"З’єднання",
    	timeout:"перервано час з’єднання",
		pwd_not_strong_enough_2:"Слабка сила пароля керування<br/>Рекомендується, щоб довжина пароля була принаймні 8 символів, включаючи числа і літери",
		pwd_not_strong_enough_3:"Слабка сила пароля керування<br/>Пропонована довжина пароля є принаймні 8 символів, включаючи числа, літери і особливі символи",
		
		data_already_exists:"Ці дані вже існують ",
		welcome_visit:"Будь ласка, введіть вітальне повідомлення ",
		block_the_current:"Не вдалося блокувати поточний пристрій, який використовується",
		no_internet:"Не з’єднано з зовнішньою мережею ",
		all_wan:"Всі зовнішні мережеві інтерфейси ",
		reselect_wan_all:"Будь ласка, переоберіть інтерфейс",
		parameters_normal:"Звичайні параметри", 
		unknown_status:"Невідомий стан ",
		without:"без",
		disconnect:"Роз’єднатися",
		connect:"з’єднатися",
		operator:"Оператор",
		line:"рядок ",
		wired_internet: "Дротовий",
		unknown_internet: "невідомо", 
		password_error: "Помилка пароля", 
		building:"Будівництво...",
		medium_password: "Принаймні 8 символів, включаючи великі та малі літери, цифри та спеціальні символи.",
		time_cannot:"Час закінчення не може бути рівним часу початку",
		generated_successfully:"Створено успішно", 
		unable_set_IPv6:"Режим доступу IPv4, L2TP чи PPTP, неможливо встановити IPv6",
		upgrade_options:"Будь-ласка, виберіть, чи увімкнути екстрене оновлення",
		read_statement_title:"Будь ласка, погодьтесь з договором про ліцензію кінцевого користувача програмного забезпечення",
    	router:"Точка доступу",
		welcome:"Вітаємо",
		reseting:"Відновлення до заводських налаштувань...",
		restarting:"Перезавантаження...",
		logining:"Реєстрація...",
		channel_choosing:"Пошук найкращого каналу……",
		uploading_file:"Завантаження файлів...",
		file_type_error:"Помилка формату файлу",
		file_upload_error:"Завантаження файлів не було успішним",
		file_upload_success:"Завантаження файлів було успішним",
		version_title1:"Ваш маршрутизатор вже має останню версію, оновлення не потрібно",
		version_title2:"У вашого маршрутизатора є нова версія для оновлення",
		version_checking:"Версія виявлена...",
		version_checking_success:"Виявлення версії було успішним",
		version_checking_error:"Виявлення версії не було успішним",
		
		abnormal_file_format:"Формат файлів неправильный, завантажте коректний файл!",
		file_size_exceed_tips:"Максимальний розмір файла не може перевищити 5М!",
		dynamic:"Динамічний IP",
		pppoe:"PPPoE",
		static_IP:"Статичний IP",
		lbl_2_4_wifi:"2.4GHz WiFi:",
		lbl_5_wifi:"5GHz WiFi:",
		lbl_wifi:"WiFi:",
		port_count_err:"Кількість внутрішніх портів повинна співпадати з кількістю зовнішніх портів",
		in_ip:"IP адреса має бути адресою сегменту LAN!",
		start_end_port:"Початковий порт не може бути більше кінцевого порту",
		s_return:"Повернення",
		edit:"Редакція",
		modify:"Виправлення",
		s_delete:"Видалення",
		delete_list:"Підтверджуєте видалення цього запису?",
		index:"Серійний номер",
		mac_addr:"MAC адреса",
		ip_addr:"IP адреса",
		op:"Операція",
		s_time:"Час",
		s_event:"Опис події",	
		version:"Версія",
		issuer:"Видавець",
		app_intro:"Ознайомлення з плагіном",
		app_info:"Інформація про плагін",
		maintainer:"Захисник",
		comfirm_default:"Ви дійсно хочете відновити системні параметри до заводських значень?",
		recover_param:"Сторінка відновлює параметри!",
		comfirm_update:"Ви впевнені, що хочете оновити файлову систему?",
		uploading:"Сторінка знаходиться в процесі оновлення!",
		left:"Інші",
		cur_speed:"Поточна швидкість мережі",
		comfirm_reboot:"Ви впевнені, що хочете відразу перезапустити систему?",
		rebooting:"Сторінка знаходиться в процесі перезавантаження!",
		wds:"Безпровідне універсальне реле",
		ap_wds:"Мостове з'єднання/точка доступу",
		client:"Безпровідна мережева карта",
		repeater:"Безпровідне реле",
		wait:"Зачекайте",
		success:"Вийшло",
		failure:"Не вийшло",
		waiting:"В очікуванні",
		less_than:"Менш",
		year_ck: "Рік введення повинен бути між 1970-2033", 
		year:"Рік",
		month:"Місяць",
		s_day:"Число",
		day:"День",
		hour:"Година",
		minute:"Хвилина",
		s_hour:"Годину",
		s_min:"Хвилина",
		second:"Секунда",
		time_segment:"Увімкнений",
		connected:"Вже з’єднано",
		not_connect:"Не підключений",
		wan_ip:"IP зовнішній мережі",
		lan_ip:"IP внутрішньої мережі",
		unknown_device:"Невідоме устаткування",
		unnamed_device:"Неіменоване устаткування",
		enable:"Увімкнути",
		closed:"Відключений",
		safe:"Безпека",
		unprotect:"Захист відключений",
		protecting:"Під захистом",
		low:"Нижній",
		medium:"Середній",
		high:"Високий",
		is_open:"Увімкнено",
		is_close:"Вимкнено",
		yours:"Ваш",
		within:"всередині",
		
		work_mode:["Режим маршруту", "режим мосту"],
		lan_reboot:"LAN фокусується на запуску, будь ласка, зачекайте хвилинку",
		lan_reboot_fin:"Перезавантаження завершено",
		no_conn:"Поточну бездротову мережу було розлучено",
		use_wifi:"Якщо ви зараз використовуєте бездротову мережу для доступу до точки доступу",
		set_router:"Налаштувати маршрутизатор",
		link_wifi:"Будь ласка, вручну з’єднайтесь з бездротовою мережею {{name}}",
		wifi_guide:"Будь ласка, перегляньте мітку назви і пароля бездротового маршрута",
		
		re_enter:"Повторите введення!",
		full_duplex:"Повний дуплекс",
		half_duplex:"Напівдуплекс",
		log_null2:"Нині немає записів журналу",
		item_null:"Запис в цьому списку порожній",
		confirm_del_log:"Ви впевнені, що хочете очистити інформацію в журналі?",
		relink:"Відключення і повторне підключення",
		auto: "Автоматичний",
		channel:"Канал",
		ip:"IP",
		mac:"MAC",
		//Помилкове нагадування у функції перевірки
		range:"Діапазон",
		need_data:"Введіть дані",
		exceed_max:"Максимальна довжина перевищена, автоматично усічена",
		exceed_max_store:"Максимальна довжина перевищена",
		comfirm_pwd:"Введіть пароль для підтвердження",
		pwd_differ:"Паролі не співпадають",
		non_null_integer:"Повторно введіть непорожнє ціле число",
		non_numeric_char:"Не можна містити нечислові символи",
		non_null_decimal:"Повторно введіть непорожній десятковий дріб",
		non_decimal_char:"Не можна містити інші символи, окрім цифр і десяткової коми",
		digital_format_incorrect:"Неправильний формат числа",
		non_null_string:"Повторно введіть непорожній рядок",
		not_illegal_char:"Не можна містити неприпустимі символи",
		illegal_char:"Неприпустимі символи",
		and:"І",
		blank:"Пропуск",
		char_not_null:"Повторно введіть непорожній рядок!",
		non_alphanumeric_char:"Не може містити символи, окрім букв і цифр",
		char_not_illegal:"Не може містити неприпустимі символи",
		cannot_contain_chinese:"Не може містити китайську",
  		char_not_chinese:"Не може містити неанглійські символи",
		domain_name_title:"Введіть дійсне доменне ім'я!",
		correct_input_ipv6Ip:"Введіть дійсну адресу IPv6",
		correct_input_ipv6Ip_endNumber:"Недійсний номер підмережі, введіть число від 1 до 128",
		state_connecting:"Підключається...",
		state_connect_success: "Ви можете отримати доступ до Інтернету, якщо Wi-Fi з'єднання успішне",
		state_connect_success_1:"З’єднання успішне",
		state_connect_success_2: "Wi-Fi підключено успішно, але поки що немає доступу до Інтернету",
		state_connect_err: "Помилка конфігурації",
		state_connect_err_2: "Збій програми WISP",
		state_connect_failed:"не вдалося підключитись",
		pwd_not_empty:"Пароль не може бути порожнім",
    	not_enc:"незашифрований",
		enc:"шифрування",
		linked:"Вже з’єднано",
		not_linked:"Не з’єднано",
		
		restore_set:"Зберегти параметри",
		change_pwd:"Змінити пароль",
		admin_pwd_not_empty:"Пароль адміністратора не може бути порожнім",
		not_chinese:"Не може містити неанглійські символи",
		server_addr_not_null:"Адреса сервера не може бути порожньою",
		not_null:"Не може бути порожнім",
		
		before_range:"Немає в діапазоні ",
		after_range:"Введіть знову",
		ip_invalid_format:"Формат адреси IP невірний",
		
        ip_not_null:"IP адреса не може бути порожньою",
        ip_val_not_null:"Значення IP не може бути порожнім",
        ip_range:"Значення IP може бути тільки між 0-255",
        ip_num:"IP адреса приймає тільки цифри",
        ip_broadcast_addr:"IP адреса не може бути широкомовною адресою",
        ip_network_addr:"IP адреса не може бути адресою сегменту мережі",
		ip_must_be_network_addr:"IP-адреса повинна бути мережевою адресою",
        start_end_ip_err:"Початковий IP адреси більше кінцевої IP адреси",
		ip_incorrect_len:"Довжина IP адреси неправильна", 
        ip_reserve_addr:"IP адреса є резервною адресою",
		not_loopback_addr:"IP адреса не може бути циклічною адресою",
		not_multicast_addr:"IP адреса не може бути груповою адресою",
        not_lan_ip_addr:"IP адреса не може співпадати з адреса маршрутизатора",
        not_lan_mask_addr:"IP адреса не може бути адресою маски",
		firsr_section_not_zero:"Перший біт IP адреси не може бути 0",
        four_section_not_zero:"Четвертий біт IP адреси не може бути 0",
		ip_getway_not_same:"IP адреса не може співпадати з шлюзом за замовченням",
		ip_default_getway_in_same_segment:"IP адреса і шлюз за замовченням повинні знаходитися в однаковому сегменті мережі",
		out_ip_in_ip_same_segment:"IP адреса зовнішньої мережі не може знаходитись в однаковому сегменті мережі з IP адресою внутрішньої мережі.",
		in_ip_out_ip_same_segment:"IP адреса внутрішньої мережі не може знаходитись в однаковому сегменті мережі з IP адресою зовнішньої мережі.",
		ip_address_already_exists:"Ця IP-адреса вже існує",
		mac_address_already_exists:"Ця мак-адреса вже існує",

        getway_not_null:"Шлюз за замовчуванням не може бути порожнім",
        getway_val_not_null:"Шлюз за замовчуванням не може бути порожнім",
        getway_range:"Шлюз за замовчуванням може бути тільки між 0-255",
        getway_num:"Шлюз за замовчуванням приймає тільки цифри",
        getway_broadcast_addr:"Шлюз за замовчуванням не може бути широкомовною адресою",
        getway_network_addr:"Шлюз за замовчуванням не може бути адресою сегменту мережі",
        getway_incorrect_len:"Довжина шлюзу за замовчуванням неправильна",
        getway_reserve_addr:"Шлюз за замовчуванням є резервною адресою",
        getway_not_loopback_addr:"Шлюз за замовчуванням не може бути циклічною адресою",
        getway_not_multicast_addr:"Шлюз за замовчуванням не може бути груповою адресою",
        not_lan_getway_addr:"Шлюз за замовчуванням не може співпадати з адресою маршрутизатора",
        getway_not_lan_mask_addr:"Шлюз за замовчуванням не може бути адресою маски",
        getway_firsr_section_not_zero:"Перший біт шлюзу за замовчуванням не може бути 0",
        getway_four_section_not_zero:"Четвертий біт шлюзу за замовчуванням не може бути 0",
		dhcp_pool_err:"Налаштування пулу адрес помилкове",
		dhcp_pool_contain_gateway:"Діапазон адрес включає IP адреси інтерфейсу. Будь ласка, змініть діапазон адрес",

		dns_not_null:"DNS не може бути порожнім",
		dns_format_incorrect:"DNS формат не правильний",
		port_not_null:"Порт не може бути порожнім",
		port_non_numeric_char:"Порт не може містити нечислові символи :",
		port_range:"Порт не може бути більше 65535 або менше 1",
		mask_err:"Помилка введення маски підмережі",
		mask_format_err:"Маска підмережі не відповідає нормам",
		mask_first_not_zero:"Перший біт підмережі не може бути 0",
		mac_err:"MAC адреса помилкова",
		mac_not:"МАС адреса не може бути порожньою",
        mac_broadcast_addr:"МАС адреса не може бути груповою адресою",
		mtu_1500_576:"Значення MTU не може бути більше 1500 або менше 576",
		mtu_1492_576:"Значення MTU не може бути більше 1492 або менше 576",
		mtu_1440_576:"Значення MTU не може бути більше 1440 або менше 576",
		mtu_1480_576:"Значення MTU не може бути більше 1480 або менше 576",
		mtu_1460_576:"Значення MTU не може бути більше 1460 або менше 576",
		mtu_1400_576:"Значення MTU не може бути більше 1400 або менше 576",
		pppoe_out_time_range:"Час тайм-ауту має бути від 1-30",
		fragment_out_range:"Діапазон порогу фрагментація знаходиться в діапазон від 256 до 2346",
		RTSThreshold_out_range:"Діапазон поріг RTS знаходиться в діапазон від 256 до 2347",
		year_range:"Діапазон час знаходиться в діапазон від 2008 до 2037",
		month_range:"Діапазон місяців: 1-12",
		day_range:"Діапазон дати: 1 –",
		hour_range:"Діапазон годинника: 0-23",
		minute_range:"Діапазон хвилин: 0-59",
		second_range:"Діапазон секунд: 0-59",
		domain_name_incorrect:"Будь ласка, введіть назву домену правильно",
		
		//消息框错误
		saveMsg:"Параметри зберігаються, зачекайте…",
		sucMsg:"Налаштування було успішним",
		errMsg:"Налаштування не було успішним",
		waitMsg:"Зачекайте...",
		updateMsg:"Помилка оновлення файла",
		exceptionMsg:"Аномальна помилка",
		msgInfo:"Підказка повідомлення",
		calendar_not_null:"Дата не може бути порожньою",
		calendar_format_err:"Формат дати неправильний",
		year_err:"Введення року неправильне",
		month_err:"Введення місяця неправильне",
		day_err:"Введення дати неправильне",
		url_not_null:"Повторно введіть непорожній сайт",
		url_err:"Сайт неправильний",
		eq_5:"Введіть 5 символів",
		eq4_20:"Введіть (4-20) символів",
		eq6_20:"Введіть (6-20) символів",
		eq8_63:"Введіть (8-63) символів",
		eq8_30:"Введіть (8-30) символів",
		eq8_31:"Введіть (8-31) символів",
		eq8_32:"Введіть (8-32) символів",
		eq8_63:"Введіть (8-63) символів",
		eq8_64:"Введіть (8-64) символів",
    	number0_32:"Будь ласка, введіть число між (0-32)",
		number7_65:"Будь-ласка, введіть число між (7-64)",
		number0_100:"Будь ласка, введіть число між (0-100)",
		number7_128:"Будь-ласка, введіть число між (7-128)",
		number0_100:"Будь-ласка, введіть число між (0-100)",
		pwd_low:"Слабо",
		pwd_medium:"Середньо",
		pwd_strong:"Сильно",
		excellent:"Відмінно",
		good:"Добре",
		bad:"Погано",
		very_bad:"Украй погано",
		
		inserted:"Вставлено",
		not_inserted:"Не вставлено",
		LTE_STATE_NO: "SIM не готовий",
		LTE_STATE_OK: "Готово",
		LTE_STATE_PIN: "Будь ласка, введіть свій PIN-код (час, що залишився на даний момент: %d разів)",
		LTE_STATE_PUK: "Будь ласка, введіть PUK-код",
		lte_pin_err: "PIN-код заблоковано",
		lte_pin_tip: "Введіть правильний PIN-код SIM-картки",
		connected:"підключений",
		not_conected:"не з'єднано",
		sim_card_not_inserted:"Вставлено SIM карту",
		sim_card_inserted:"активація SIM картки",
		
		whole_day:"Відключення",
		check_one: 'Перевірте хоча б один елемент',
		all_day: 'Кожного дня', 
		dayList:["Mon.","Tue.","Wed.","Thu.","Fri.","Sat.","Sun."],
		week:"Тиждень",
		day0:"Понеділок",
		day1:"Вівторок",
		day2:"Середа",
		day3:"Четвер",
		day4:"П'ятниця",
		day5:"Субота",
		day6:"Неділя", 
	  	repeater_mutex_tips:"Увімкнено режим розширення діапазону, поточна функція тимчасово недоступна",
		wisp_mutex_tips:"Режим WISP увімкнено, поточна функція тимчасово недоступна",
		bridge_mutex_tips:"Режим точки доступу увімкнено, поточна функція тимчасово недоступна"
	}

};



//other
//auto_fade параметр: чи автоматично зникає спливаюче вікно
var message_panel =message_panel|| new Object();
message_panel = {
	save:{
		type:"wait",
		auto_fade:false,
		message:"Параметри зберігаються, зачекайте……"
	},
	success:{
		type:"success",
		auto_fade:true,
		message:"Налаштування було успішним"
	},
	wait:{
		type:"wait",
		auto_fade:false,
		message:"Зачекайте...."
	},
	
	exception:{
		type:"error",
		auto_fade:true,
		message:"Аномальна помилка"
	},
	error:{
		type:"error",
		auto_fade:true,
		message:"Налаштування не було успішним"
	},
	
    msg_info:{
        type:"msg-info",
        auto_fade:true,
        message:"Підказка повідомлення"
    }
};

var L = language["UK"]["JS"];
